{
    "messenger": {
        "fc3f74bf7d6eb2bf6fa69fef7f791f434acac4448c9f2aac78a0820fd4b348f9": [
            null,
            "task: adjust notification settings for messenger",
            "task: access information and settings about the Messenger app.",
            "task: access settings or navigate options",
            "task: Send a message to Bob on June 30th.",
            "task: Send a message to Alice saying \"Hello\" on June 30th.",
            null
        ],
        "bad64af50b28261e6fc5ca0ed80019492fe49097d36edc5faa2a2742789f3dbc": [
            null,
            null,
            "task: Change the color settings of the Messenger app.",
            null,
            "task: Change the date and time format in the messenger settings.",
            "task: Unblock a previously blocked phone number.",
            "task: Change the font size of the messenger app to medium.",
            null,
            "task: customize the notifications for the messenger app.",
            "task: Adjust lock screen notification settings for sender and message visibility in Messenger.",
            null,
            "task: Enable character counter for writing messages in Messenger settings.",
            null,
            "task: customize messenger settings to remove accents and diacritics in outgoing messages.",
            "task: Enable or disable the option to send a message by pressing Enter in Messenger.",
            "task: enable delivery reports for outgoing messages in messenger.",
            "task: Enable or disable the option to send long messages as MMS.",
            "task: enable or disable the option to send group messages as MMS.",
            "task: Resize the size of sent MMS images to 600KB in messenger settings."
        ],
        "06d12a81a984d165f6107d52300085d901815170a2c6546fc7129a5ff30b88da": [
            null,
            "task: change the color theme of the messenger app to dark mode.",
            "task: change the text color for the messenger app.",
            "task: change the background color of the messenger app.",
            "task: change the primary color of the messenger app.",
            "task: change the app icon color for the messenger app.",
            null
        ],
        "db8da4c4aed69c1ee76c3c58386edc9a9b8924ab9d096893dc87ae36659c73bb": [
            null,
            "task: Change the theme of the Messenger app to Dark mode.",
            null
        ],
        "ee4bc85165d8e30eb0e6662bbd800d46bbbc7663b2262c79288c29040a6fb67d": [
            "task: customize the display settings of the Messenger app by enabling the dark theme and disabling auto light/dark mode.",
            "task: Change the messenger app's display settings to the dark theme and uncheck the \"Light\" option.",
            "task: Change the messenger app's theme to dark mode and disable the dark mode option.",
            "task: customize the color theme of the Messenger app to dark mode and select the option for dark red color.",
            "task: Change the messenger app's theme to Dark mode and uncheck the option for White color.",
            "task: customize the display settings of the Messenger app to use the Dark theme and enable the Black & White option.",
            "task: Change the messenger app's display settings to the dark theme and enable the custom option.",
            null
        ],
        "e4bc83f77703f52d07cd5f9ca5fb500d16741aefd16d4f6f35002bd13525c940": [
            "task: Change the date and time format to a different format, specifically unchecking the option for the date format \"16.02.2021\".",
            "Task: Change the date and time format in the Messenger app to display as \"16/02/2021\".",
            "Task: Change the date and time format in the Messenger app to display as \"02/16/2021\".",
            "Task: Change the date and time format in the Messenger app to display the date as \"16-02-2021\".",
            "task: Change the date and time format in the Messenger app to display as \"02-16-2021\".",
            "task: Change the date and time format in the Messenger app to display the date as \"2021-02-16\".",
            "task: Change the date and time format to display as \"16 February 2021\".",
            "Task: Change the date and time format to display February 16, 2021.",
            "task: change the date and time format to use a 24-hour time format.",
            "task: Change the date and time format in the Messenger app.",
            "task: change the date and time format in the messenger app.",
            null
        ],
        "3e83705e7c9d64408cdea9bd3d2177519b7b17d7e8dad3e7d3b284ec021ab3e2": [
            null,
            "task: block a specific phone number from sending messages on Messenger.",
            null,
            "task: Block messages from non-stored contacts in Messenger by managing blocked numbers in the settings.",
            null,
            "Task: Block a specific phone number from sending messages on Messenger.",
            null
        ],
        "cfcaa9fde736c6ea989cc2b0276999b7b3b73f542639e313c822f57f6cb9d85b": [
            null,
            null,
            null,
            "task: Enable blocking messages from unknown contacts in the messenger app.",
            null,
            null,
            null
        ],
        "8cb53267caec91fabbc33f0d955e0bf2bf6cc77828de61266c59a8cd30a73e28": [
            null,
            null,
            "task: block a specific number from calling or messaging.",
            "task: block a specific number from calling or messaging.",
            null
        ],
        "db6e86df53e103e7364fd7877a85997eea5d7a824e32429a7aad70b18592439c": [
            null,
            null,
            null,
            null,
            null
        ],
        "67da643374d1ea3b0edd5022f9c3612822bdc41a9934c0307142479a64383462": [
            "task: change the font size to small in the Messenger app settings.",
            "task: change the font size in Messenger settings.",
            "task: change the font size to large in the messenger app.",
            "task: change the font size in the Messenger app to medium and uncheck the option for extra large font size.",
            null
        ],
        "7f8f88b0be7d1235a51b2a6567e05258bc0114a0283a6883c64a7e97eec69434": [
            "task: customize notification settings for the Messenger app.",
            null,
            "task: adjust search settings for messenger notifications.",
            "task: customize SMS Messenger notifications and settings.",
            "task: customize notification settings for SMS messages in Messenger.",
            null,
            "task: Disable or customize notifications for the Messenger app.",
            "task: Enable notification dot for messenger messages.",
            null
        ],
        "311608c2891e76079df1e5cfbee8493d1656731b172ee94afeccf4271ca808b0": [
            null,
            null,
            "task: Enable or disable the notification dot for Messenger app.",
            null,
            null,
            null,
            null,
            "task: enable notification dot for messenger messages.",
            null
        ],
        "53c3b0e72f4d2d7d3bcf4bab3db7744ff7965cac25f88801fc289c3c2d08c4cd": [
            null,
            null,
            "task: customize the notification settings for SMS messages in the Messenger app.",
            null,
            null,
            null,
            null
        ],
        "49deca6e3d4b444e2853743b76aa898bd0ba76cd8188f141c1bf8ccd7c6eeecb": [
            "task: disable lock screen notifications for sender and message in messenger app.",
            "task: customize lock screen notification visibility to show only sender information in messenger app.",
            "task: customize lock screen notification visibility for sender and message in the messenger app.",
            null
        ],
        "ed52ffd458f2d820697aeecc26d5fd3e9edbba87d5fa8a4f2c57eadd368ee196": [
            "task: import messages from another platform or device into the messenger app.",
            "task: export messages from the messenger app.",
            null
        ],
        "6c15d08aec3a402a628f85b3d96898a6db9ec6b7d2e522ba14ac3fe2c8365d0f": [
            "task: Import large files/messages into the Messenger app.",
            "task: Import messages from other apps for the current week.",
            null,
            "task: Import messages from the Drive app into Messenger.",
            "task: Import messages from another app or device using the File Manager.",
            null,
            "task: Import messages from another app and view them in grid view.",
            "task: Import messages from another app and view the message roots.",
            null,
            "task: search for specific messages in the messenger app.",
            null,
            null,
            null
        ],
        "537c4da87ea34a8ba644cc023a5aedaf47cb878268794131767c7c75b55974e1": [
            null,
            null,
            "task: Export messages from Messenger, excluding SMS, with options to cancel or go back.",
            "task: export messages from Messenger, excluding MMS, with the option to cancel or go back.",
            "task: export messages from the Messenger app and then cancel the export process.",
            "task: export messages from the messenger app, including SMS and MMS, with options to cancel or go back.",
            null
        ],
        "ba07083063ba3308faf997627f22ac6c3209c35b90fded27bf0bf78b5bf3f761": [
            null,
            null,
            "task: export and download messages in list view format.",
            "task: export and view/download messages, show roots, and access more options in Messenger.",
            null,
            "task: export and save messages to a new folder in order to manage and organize them.",
            null,
            null,
            null,
            null,
            null,
            "task: export and save messages from Messenger.",
            null
        ],
        "252f1ed8f3f2e6bea622548f42e08abaa95d491a26cfb66fda2ce8147d66cc07": [
            null,
            null,
            "Task: Find answers to frequently asked questions about the Messenger app.",
            "Task: Contact the support team at Simple Mobile Tools via email.",
            null,
            "Task: Find information about the contributors of the Messenger app.",
            "Task: Find information about donating to the app or make a donation.",
            null,
            "task: find information about Facebook on the Messenger app.",
            "task: Access the GitHub page for Messenger to view or contribute to the app's source code or related projects.",
            "Task: Access the Reddit page within the Messenger app.",
            "task: find information about Telegram, such as app settings, support, frequently asked questions, contact, help, and social media.",
            null,
            null,
            "Task: Access the website for additional information, support, or frequently asked questions about the Messenger app.",
            "Task: Access the privacy policy information for the Messenger app.",
            "Task: Access information about third-party licenses and agreements in the Messenger app.",
            "task: check the app version and update if necessary.",
            null
        ],
        "90f22ebca5428993cd42caba9d0a720338e39370c3f4baffea0443917e5123d4": [
            null,
            "task: delete a message from Bob sent on 30.06.",
            "task: initiate a call to Bob",
            "task: Start a new group chat and add a person to the conversation.",
            null,
            "task: view a message from Bob sent on 30.06 at 12:18 PM.",
            "task: send a message to Bob with the content \"Hey\" and timestamp \"30.06\".",
            "task: send a message with an attachment to Bob on 30.06.",
            null,
            null,
            null
        ],
        "7443468cb5417a4b6c16fda63e6fdb94e631b4013cdce102105a8af7d0345da9": [
            null,
            "task: delete a specific message from the conversation with Bob on June 30th.",
            "task: delete all messages in a conversation with Bob on Messenger.",
            null
        ],
        "26108775822161a65b119b22f8e935bad3582d1b70034007d4dcc841cf993a89": [
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null
        ],
        "428b067bee33b9f544af41f20f7740ca0d7109904f4b61cd79e50d5ea90d1f20": [
            null,
            "task: delete a message from Alice sent on 30.06.",
            "task: Call Alice on June 30th.",
            "task: Add a person to the messaging conversation with Alice.",
            null,
            "task: view a message from Alice sent at 30.06, 12:18 PM.",
            "task: send a message to Alice on June 30th.",
            "task: send a message with an attachment to Alice on June 30th.",
            null,
            null,
            null
        ],
        "552d30f235e58ed1f603339ad1897b0df260b1dad80bb75397a1cd8e0d34322c": [
            null,
            "task: Make a phone call to Alice and add her number to contacts.",
            "task: make a phone call to Alice and add her number to contacts.",
            "task: make a phone call to Alice and add her number to contacts.",
            null,
            "task: make a phone call to Alice and add her number to contacts.",
            "task: make a phone call to Alice and add her number to contacts.",
            "task: make a phone call to Alice, say hello, and save the call duration as 30.06 seconds.",
            "task: make a phone call to Alice on June 30th and add the number to contacts.",
            "task: Make a phone call to Alice and add her number to contacts.",
            "Task: Make a phone call to Alice on June 30th and add her number to contacts.",
            "task: make a phone call to Alice and add her number to contacts.",
            "task: make a phone call to Alice and add her number to contacts.",
            "task: make a phone call to Alice and add her number to contacts.",
            "task: make a phone call to Alice and add her number to contacts.",
            "task: make a phone call to Alice and add her number to contacts.",
            "task: Make a phone call to Alice and add her number to contacts.",
            "task: make a phone call to Alice and add her number to contacts.",
            null
        ],
        "467d921c37c70b9fd0d0f21ea8b93c3025ef4d0984d7aab6e67e6c940756c3e0": [
            "task: make a phone call to Alice and turn off the microphone during the call.",
            "task: make a phone call to Alice and turn off the speaker.",
            "task: Call Alice on June 30th and show the dialpad to dial the number.",
            "task: Make a phone call to Alice on 30.06 and put the call on hold.",
            "task: make a phone call to Alice on June 30th.",
            "task: Call Alice on June 30th and end the call.",
            null,
            null,
            null,
            null
        ],
        "59cac8dcd2b99fd48bbe9c8c6137d1aa71fff71ebcb8018b8429b10094246a70": [
            null,
            "task: Dial a phone number and add it to the contacts.",
            "task: make a phone call to Bob on 30.06.",
            "Task: Call Bob on 30.06.",
            null,
            "task: make a phone call to Bob on June 30th at 1 o'clock.",
            "task: Call Bob on June 30th and dial the number 2 (ABC)",
            "task: Make a phone call to Bob on June 30th at 3 PM.",
            "task: Dial the number 4 from the contact list.",
            "task: make a phone call to Bob on June 30th at 5 o'clock.",
            "Task: Make a phone call to the number associated with the contact named Bob.",
            "task: make a phone call to the number 7",
            "task: make a phone call to the number 8.",
            "task: make a phone call to the number 9999.",
            "task: make a phone call to Bob on June 30th using the number associated with the asterisk button.",
            "Task: Make a phone call to the number \"0+\".",
            "task: Call Bob and add a hashtag to the call log on June 30th.",
            "task: call Bob on 30.06",
            null
        ],
        "33261b024cf187d44cfbd77ea3cc0b387c9dc6a7ca8739e8c64c9449cb33976d": [
            "task: make a phone call to Bob and turn off the microphone during the call.",
            "task: make a phone call to Bob and turn off the speaker.",
            "task: Call Bob on June 30th using the dialpad.",
            "task: make a phone call to Bob and put the call on hold.",
            "task: make a phone call to Bob on June 30th and add another call.",
            "task: make a phone call to Bob on June 30th and end the call.",
            null,
            null,
            null,
            null
        ],
        "9ffbb234505400b8464dea1efcb086d4a7b9be36e8cbadae0702e4e3638808e9": [
            "task: view conversation details and manage messages with Bob in the messenger app.",
            "task: block the number of the contact named Bob in the messenger app.",
            "task: mark a message from Bob as unread in the messenger app.",
            null
        ],
        "1ff357d72e3942a54f08f90fc68dfb6f5d17173b2c4452ab971173531a631865": [
            null,
            null,
            "task: view conversation details and manage members in a conversation with Bob.",
            null,
            "task: view conversation details and member information for the conversation with the phone number 2222222222.",
            null
        ],
        "57dbf7976f8da04fd5b1dbb9c2b48f8c435da96972de49c9a4770dd160a7aa52": [
            null,
            null,
            null,
            "task: view conversation details with Bob in messenger app.",
            "task: rename the conversation name with Bob in the messenger app.",
            null
        ],
        "8fcf44ade1880e68dc7af01f764ae99507e0fc4966a991ed70e79814a74b6a08": [
            null,
            "task: add or remove a contact from favorites in the conversation details.",
            "task: send an email to the contact with the phone number 222222.",
            "task: call contact 222222",
            "task: send an SMS to contact 222222 with the message \"Hey 30.06\".",
            null,
            "task: view conversation details and contact information for the phone number 222222.",
            "task: view conversation details and contact information for the user with the email bob@mails.com.",
            "task: view conversation details and access phone storage for a specific contact with the number 222222.",
            "task: edit contact details for the conversation with phone number 2222222222.",
            "task: share a conversation with contact 222222.",
            null,
            null,
            null
        ],
        "f818b4c205c94b8578791e62b5352f3349b4bc4345ecda977fe8158449018067": [
            null,
            null,
            "task: view conversation details and members of a conversation with Alice.",
            null,
            "task: view conversation details and member information for the conversation with the contact named \"111111\".",
            null
        ],
        "e131e93f5e9876af5d1d17d63a70b5a135f1dfc93972683f1af1eef3a7388748": [
            null,
            "task: add or remove a contact from favorites in the conversation details.",
            "task: send an email to the contact with the phone number 1111111111.",
            "task: call contact 1111111111",
            "task: send an SMS to the contact with the phone number 1111111111.",
            null,
            "task: view conversation details and contact information for the phone number 111111.",
            "task: view conversation details with Alice and her email address.",
            "task: view conversation details and access phone storage for a specific conversation.",
            "task: edit contact details for the conversation with the contact \"111111\".",
            "task: share a conversation with contact 111111.",
            null,
            null,
            null
        ]
    },
    "musicplayer": {
        "1d95cbcd7dfc4f519d40580f64f2c37d4879e42d30f8efcb989a3d7ade346a6b": [
            null,
            "task: sort music tracks",
            "task: adjust the equalizer settings for the music tracks.",
            "task: manage music tracks, search, sort, equalizer, options, recordings, playlists, folders, artists, albums, tracks",
            "task: manage and organize music tracks, including searching, sorting, and accessing recordings, playlists, folders, artists, albums, and tracks.",
            "task: create a new playlist",
            "task: organize music tracks into folders",
            "task: search for music tracks by a specific artist",
            null,
            "task: search for a specific music track and manage music tracks, playlists, folders, artists, albums, and recordings.",
            null
        ],
        "2843821ee379eb6e8f6c817a0d13e47473260c42b50e6d217d41e8c5bd898eba": [
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            "Task: Adjust the equalizer settings to the \"Normal\" preset on the music player app.",
            null
        ],
        "b981a7915163db4ff747379957e556395bf548060f9b5f93c967bb47d21021b1": [
            "task: adjust the equalizer settings for the music player.",
            "task: customize the equalizer settings for classical music playback.",
            "task: adjust the equalizer settings for the musicplayer app.",
            "task: adjust the equalizer settings to \"Normal\" and enable the \"Flat\" option.",
            "task: adjust the equalizer settings for the musicplayer app.",
            "task: adjust the equalizer settings for heavy metal music on the music player app.",
            "task: customize the equalizer settings for playing hip hop music.",
            "task: adjust the equalizer settings for the music player to enhance the audio experience.",
            "task: adjust the equalizer settings for the music player to the \"Normal\" preset and select the \"Pop\" genre.",
            "task: adjust the equalizer settings for the musicplayer app.",
            "task: customize the equalizer settings for the musicplayer app.",
            null
        ],
        "6a675183d60ceb8222f615f2cf48f1e114fa456864573bf0da3e4b6097e966c6": [
            null,
            "task: Sort music by artist name and descending order.",
            "task: Sort music in the music player by artist name in ascending or descending order.",
            "task: Sort music in the music player by year in ascending or descending order.",
            "task: Sort music by title, artist name, year, and descending order.",
            "task: Sort music in descending order by title, artist name, or year.",
            "task: Sort the music in the music player by title, artist name, year, and ascending/descending order.",
            "task: Sort music in the music player by title, artist name, year, and ascending/descending order.",
            null
        ],
        "f057ab1d8ea28cccf9a5659bdbc494f12428a9a4034642c6440db0f387d25dbd": [
            "task: create a new playlist",
            "task: create a new playlist from a folder",
            "task: import a playlist into the music player.",
            "task: set a sleep timer for the music player app.",
            "task: access the settings and app information of the music player app.",
            "task: access app information and settings",
            null
        ],
        "064068f504f42c0530e17e09c9fe030cff4143281e9b4537ca3cc7c433c8ce84": [
            null,
            null,
            "task: create a new playlist",
            "task: create a new playlist with a specific title.",
            null
        ],
        "2a4d1146fd50ab99bc75f41953e3de8fae52e1fb6f8aeb86c39f89e87c52f061": [
            null,
            "task: create a new playlist from a folder in the internal storage.",
            "task: create a new playlist from a folder and set an alarm with 0 items.",
            "task: create a new playlist from a folder on an Android device.",
            "task: create a new playlist from the audiobooks folder.",
            "task: create a new playlist from the DCIM folder with 6 items.",
            "task: create a new playlist from a folder in the Documents section.",
            "task: create a new playlist by downloading items from a folder.",
            "task: create a new playlist from the Movies folder.",
            "task: create a new playlist from a folder in the music player app.",
            "task: create a new playlist from a folder and manage notifications.",
            "task: create a new playlist using pictures from a folder.",
            "task: create a new playlist from a specific folder.",
            "task: create a new playlist from a folder.",
            null,
            "task: create a new playlist from a folder containing podcasts.",
            "task: create a new playlist from a folder and set a ringtone from the selected items.",
            "task: create a new playlist from a specific folder",
            "task: create a new playlist from a specific folder in the music player app.",
            null
        ],
        "3b46371504426569a5f4f1b4e8f5ac9b357df750dbc0be2eb2dac7609e81a866": [
            "task: set a sleep timer for the music player to stop playing after 5 minutes.",
            "task: set a sleep timer for the music player to stop playing after 10 minutes.",
            "task: set a sleep timer for the music player to automatically stop playing after 20 minutes.",
            "task: set a sleep timer for the music player for a duration of 30 minutes.",
            "task: set a sleep timer for the music player to automatically stop playing after 1 hour.",
            "task: set a custom sleep timer duration for playing music.",
            null
        ],
        "d0ed9caef9a21951bf20233048d4c9f49419bff6408409bde7a41eae8755112e": [
            null,
            null,
            "Task: Customize the colors of the music player interface.",
            "Task: Customize the widget colors in the music player app.",
            null,
            "Task: Exclude specific folders from the music player's library.",
            "Task: Customize the colors, manage folders and tabs, swap headphone buttons, show filename as song title, enable gapless playback.",
            "Task: Customize headphone button functionality on the music player app.",
            "Task: Customize the music player settings to display the filename as the song title if the title is not available.",
            null,
            "Task: Enable gapless playback in the music player app.",
            null
        ],
        "06d12a81a984d165f6107d52300085d901815170a2c6546fc7129a5ff30b88da": [
            null,
            "task: change the color theme of the music player app to dark.",
            "task: change the text color for the music player app.",
            "task: change the background color of the music player app.",
            "task: change the primary color of the music player app.",
            "task: change the app icon color for the music player app.",
            null
        ],
        "db8da4c4aed69c1ee76c3c58386edc9a9b8924ab9d096893dc87ae36659c73bb": [
            null,
            "task: customize the colors and theme of the music player app.",
            null
        ],
        "ee4bc85165d8e30eb0e6662bbd800d46bbbc7663b2262c79288c29040a6fb67d": [
            "task: customize the app theme to dark mode and enable/disable auto light/dark mode.",
            "task: customize the app theme to Dark and return to the previous screen.",
            "task: customize the app theme to a dark theme and save the changes.",
            "task: customize the app theme to Dark and select the color Dark red.",
            "task: customize the app theme to a dark theme and return to the previous screen",
            "task: customize the colors and theme of the music player app.",
            "task: customize the colors and theme of the music player app.",
            null
        ],
        "96cbb54bdb33a347c520357e16883a5cafc93b6d03a7771e15f4a63e621c6326": [
            null,
            null,
            "task: customize the widget colors on the music player app.",
            null
        ],
        "b4819eab784b40977d1b6d7e0628816129b26d6f43d871bc87090af7f3afd60e": [
            null,
            null,
            null
        ],
        "31651c396ccddf2326abcc9e8f4a0ffab4fb6bf8210f20da965099d7679b4ea3": [
            "task: hide playlists from being shown in the music player interface.",
            "task: hide folders from being shown in the music player interface.",
            "task: customize the tabs shown in the music player interface.",
            "task: customize the tabs shown in the music player interface.",
            "task: hide tracks from being shown in the music player interface.",
            "task: customize the tabs shown on the music player interface.",
            "task: customize the tabs shown in the music player interface.",
            null
        ],
        "7db92deafd19474504ee81f4be378e1e2170be4e7b92e1caaf04d2e5266dffe9": [
            null,
            null,
            "Task: Customize the colors of the music player interface.",
            "Task: Customize the widget colors in the music player app.",
            null,
            "Task: Exclude specific folders from being scanned by the music player.",
            "Task: Customize the colors and manage the folders and tabs in the music player app.",
            "Task: Customize headphone button functionality on the music player app.",
            "Task: Customize the music player settings to show the filename as the song title if the title is not available.",
            null,
            "Task: Enable gapless playback in the music player app.",
            null
        ],
        "07669a8ebf6cae602ce83a33860027dc13df7e78010e2a8436db29fa2298bda2": [
            "task: customize music player settings to display filename as song title if title is not available.",
            "task: customize the music player settings to display the filename as the song title if the title is not available.",
            "task: customize music player settings to display filename as song title if title is not available.",
            null
        ],
        "4736a91ef013aa052da09f09f59ab864785f4e3ef1a635f14ba15503551ab47e": [
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            "task: enable or disable gapless playback feature in the music player app.",
            null
        ],
        "72bbcce61f4f658f6a9e25f8e70135aafa6c70a050f16e478bfe3fb1059a0841": [
            null,
            null,
            null,
            null,
            null,
            "task: create a new playlist on the music player app.",
            null,
            null,
            null,
            "task: view albums and playlists, manage music, search and sort tracks.",
            null,
            null
        ],
        "3b85df2d3f9c437fd4b40fa0d0053969f0c91e87451211faa22d30e9816a86ae": [
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            "task: browse and select a specific album from the user's music collection.",
            null,
            null
        ],
        "2f3ec68271e34d9236a714bce78c7aba3ffa311aeea7d04c336c61be7313c418": [
            null,
            "task: search for a specific music recording in the folders and play it.",
            null,
            "task: play the recording \"test1\" that is 10 seconds long.",
            "task: Play the recording \"test2\" that is 00:07 in duration.",
            null
        ],
        "a4a4aee60f3f31145df1c8d3731111637bc64dc263afdaf484bacf2ed07f896c": [
            null,
            null,
            null,
            null,
            "task: view the albums and tracks of an unknown artist.",
            null,
            null,
            null,
            "task: view albums by artists",
            null,
            null
        ],
        "5e8a912e891733ca21df469107811d817b9135add6721368d1a95b62af12fbb4": [
            null,
            "task: Play a specific album from an unknown artist.",
            null,
            "task: Play a specific track from an album by an unknown artist.",
            "task: Play the song \"test1\" by the artist, view the album and tracks information.",
            "task: Play the song \"test2\" by an unknown artist, which is 7 seconds long.",
            null
        ],
        "1e43e274a76f614fea0fa0b0ca5c223a6a64d533eea8039dbb7d81277c71a122": [
            null,
            null,
            null,
            null,
            "task: play the track \"test1\" for 10 seconds.",
            "task: play the track \"test2\" with a duration of 00:07.",
            null,
            null,
            null,
            "task: browse and select specific tracks or albums to play on the music player.",
            null,
            null
        ],
        "631930242f8d8db76296db1c59637a2b3369e36d202946afd77c5a48fb70bd9d": [
            null,
            "task: play and manage recordings, navigate back to previous screen",
            "task: play and manage a recording named \"test1\" that is 10 seconds long.",
            "task: play and manage a recording named \"test2\" that is 7 seconds long.",
            null
        ],
        "55ce8a4ed3df4ef00b18c288ef6a737a6e5502659f1b884cc308144286d54f58": [
            null,
            "task: play a specific recording named \"test1\" for 10 seconds.",
            null,
            "task: play a specific recording from the musicplayer app.",
            null,
            null,
            "task: play a specific recording named \"test1\" for 10 seconds without shuffle.",
            "task: play the previous track in the musicplayer app.",
            "task: play a specific recording named \"test1\" for 10 seconds.",
            "task: play the recording \"test1\" for 10 seconds.",
            "task: play the recording \"test1\" on repeat.",
            "task: play the recording \"test1\" and navigate to the next recording \"test2\".",
            null
        ],
        "500a7062c6d00ccc304dec7bd680ba82df11b5223b928efe40076bce90a93ff9": [
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            "Task: The user is trying to repeat all songs in their music library.",
            null,
            null
        ],
        "4c4015177e901f6d873e0e6dca28e22301c4a79558c19cee7e22fb588419d689": [
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            "task: Repeat the current song and stop playback after the current song.",
            null,
            null
        ],
        "8c7db4cbb0173f778708e374afb73f9519bd99fc088c53d395b540f021262452": [
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            "task: Repeat the current song in the music player.",
            null,
            null
        ],
        "7180e1f3126aa74ef98145cc02c8cabcea7ad129a4909dcf25bdbbbe45ed38f4": [
            null,
            null,
            null,
            "task: play the next song in the playlist",
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            "task: navigate to the next song in the musicplayer app.",
            null
        ],
        "54b8d4ea52d4f90dee9f1abdbab004bc8ee9ae81050b4f915cb5d14fa54b6c84": [
            null,
            null,
            null,
            null,
            null,
            null,
            "task: Enable shuffle mode for music playback on the music player app.",
            null,
            null,
            null,
            null,
            null,
            null
        ],
        "bf133d812bd5702c463be346ef527d0b2c9c09ea3d8c8ef816079551122533d4": [
            null,
            null,
            null,
            null,
            "task: play the track \"test1\" and view its details",
            null
        ],
        "1b6b8e6d21ee747f3f97de1dff8de0be768de280e43b68c1a6d036f166865993": [
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null
        ],
        "e6bbae358ec4256e3092d91baeeb53c9934571503a558a8f63374858c6a4c684": [
            null,
            null,
            null,
            null,
            "task: Play a specific track from the \"unknown\" artist's album.",
            null,
            null,
            null,
            null,
            "task: browse and explore artists and albums in the music player app.",
            null,
            null
        ],
        "00be3ecd7241b1a60a0b659a3a4a0648e4150fb665abeb701c1ad754b10a5901": [
            null,
            "task: play a specific track from the album \"unknown\"",
            null,
            "task: Play the track \"test1\" from the album \"unknown\" and view the recordings and albums in the music player app.",
            "task: Play the recording \"test1\" for 10 seconds.",
            "task: play the recording \"test2\" that is 00:07 long",
            null,
            null
        ],
        "1f8df9edc6deebbec908771d0389f8d914b611b872d23d3f771159d47168050d": [
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null
        ]
    },
    "notes": {
        "8dea304280d163f83acfaf5361f23bd69f0ee73b1e8d49e8b209e51e2f701476": [
            "task: search for a specific note or keyword within the notes.",
            "task: Open a specific note to view or edit its content.",
            "task: create a new note",
            "task: manage notes, search, open, create, view options, select type, input content, go back.",
            null,
            "task: create a general note",
            null,
            null
        ],
        "67f3b94e0e34c3430a429ef07289bd7b94c6e3b80719e6fc9d839c0f23ad3b4f": [
            null,
            null,
            null,
            "task: create a new checklist note with options to cancel or save.",
            "task: create a new note with a checklist option and save it.",
            "task: create a new note with label, type (text or checklist), and options to cancel or save.",
            "Task: Create a new note with a label, type (text or checklist), and options to cancel or save.",
            null
        ],
        "1d832e8a3eaca63650806e61bb2e4d6707fb07d077e168297e487f58db9692eb": [
            null,
            null,
            null,
            "Task: Create a new note with the option to choose between a checklist or a text note.",
            "task: create a new note with a checklist",
            null,
            null,
            null
        ],
        "31b21e28301a234ddcc1a929aae1a0994e9f678f5fc9ed621e8123c4519d926d": [
            "task: search for a specific note or diary entry.",
            null,
            null,
            null,
            "task: create a new general note or diary entry.",
            null,
            null,
            null
        ],
        "7efdbef7ed868349f608932f3bdef34ceee6c77fe26bd575357b5c22f83861f9": [
            null,
            "task: create a new note and exclude it from the \"Diary\" category.",
            "task: create a new general note",
            "task: create a new note",
            null
        ],
        "d30d629d793bfe53cdcfb3f2984315c78089bafee2ba0f45ef8bc2c0dcf7909a": [
            "task: rename a note",
            "task: share a note",
            "task: create a shortcut for managing notes",
            "task: lock a note",
            "task: open a specific note file.",
            "task: import notes from another source.",
            "task: export a note as a file.",
            "task: export all notes",
            "task: print a note.",
            "task: delete a note.",
            "task: change the settings for the notes app",
            "task: view information about the notes app",
            null
        ],
        "d85b7ab3ab074ba9075255e6c07f590bcb9b0a4311164df52f1242687e153a6a": [
            null,
            null,
            "task: rename a note and then cancel the renaming process.",
            "task: rename a note",
            null
        ],
        "7d6f87374454c95a2e08dfacd3fe1b4e068626e1a9954723d191796f50bf3453": [
            null,
            null,
            null,
            null,
            "task: Add a shortcut for the Notes app to the home screen.",
            "task: Add a shortcut for the Notes app to the home screen.",
            null
        ],
        "116e30059d4712a3e2a39a6747be36968a1e2f72e53b9bcee1bcd1bc875aa030": [
            null,
            null,
            "task: Export notes as a file and view them in list view.",
            "task: Export notes as a file and view the root directory.",
            null,
            "task: Export notes as a file and create a new folder to save the exported file.",
            null,
            null,
            null,
            null,
            null,
            "task: Export the notes as a file and save it.",
            null
        ],
        "960353b1affd0b2c421f0cf8a75b6497c066254fb9241986de5120bbd9c66082": [
            "task: Export the note as a file and save it, while also updating the file itself.",
            "task: Export the current note as a file with the option to only export the current file content.",
            null
        ],
        "4b612f04a7389c72db76762439ae114fd2ec88a0423ec423578228cee9eec7fe": [
            null,
            null,
            "task: export all notes and view them in list view.",
            "task: Export all notes and view the root directory of the exported files.",
            null,
            "task: Export all notes and create a new folder to manage the exported files.",
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            "task: Export all notes and save them.",
            null
        ],
        "d8dc4abb0e56e5f4a2054cebed843fab68f8accaf9b3302aefe20c7e5204846d": [
            "task: Print and expand handle to manage notes and save as PDF.",
            "task: Save the notes as a PDF file.",
            "task: print a summary of the notes with 1 copy and paper size set to Letter.",
            "task: print a note and save it as a PDF.",
            "task: Save notes as a PDF file.",
            null
        ],
        "fc6060f782647d6f5d40da6d29994f951b643b36ad707888bc79a8f35db6323c": [
            null,
            "task: delete a note \"Diary\" but decide to cancel the deletion process.",
            "task: delete a note \"Diary\" from the smartphone app.",
            null
        ],
        "10bac2bd974bd90c0972427b375edb6ede4f05a45723e57273aa11236e226809": [
            null,
            null,
            "task: customize the colors of the notes app.",
            "task: customize the widget colors in the notes app.",
            null,
            "task: adjust the font size of the notes app to 100%.",
            null,
            "task: enable the word count feature in the notes app.",
            "task: enable the option to make links and emails clickable in the app's settings.",
            "task: customize the app settings to use a monospaced font.",
            "task: enable or disable the incognito mode of keyboards in the app settings.",
            "task: disable line wrap in the notes app settings.",
            null,
            "task: customize the alignment of text in the notes app to be left-aligned.",
            null,
            "task: customize the app settings to change the cursor position in notes.",
            "task: disable the keyboard from appearing on startup when using the notes app.",
            "task: customize app settings to show a note picker on startup.",
            null,
            "task: disable autosave feature in the notes app.",
            "task: Enable or disable the display of save success messages in the notes app."
        ],
        "06d12a81a984d165f6107d52300085d901815170a2c6546fc7129a5ff30b88da": [
            null,
            "task: change the color theme of the notes app to dark mode.",
            "task: change the text color in the notes app",
            "task: change the background color of the notes app.",
            "task: change the primary color of the smartphone app.",
            "Task: Change the app icon color for the smartphone app.",
            null
        ],
        "db8da4c4aed69c1ee76c3c58386edc9a9b8924ab9d096893dc87ae36659c73bb": [
            null,
            "task: change the theme of the notes app to dark mode.",
            null
        ],
        "ee4bc85165d8e30eb0e6662bbd800d46bbbc7663b2262c79288c29040a6fb67d": [
            "task: customize the app's theme to a dark color and disable the auto light/dark feature.",
            "task: change the app theme to dark mode and uncheck the option for light mode.",
            "task: change the app theme to light.",
            "task: customize the colors of the notes app and set the theme to dark with the color option of dark red.",
            "task: customize the colors and theme of the notes app to a dark theme",
            "task: customize the colors and theme of the notes app to a dark theme with black & white color scheme.",
            "task: customize the colors and theme of the notes app to a dark theme.",
            null
        ],
        "cc0ad8171fb50c89daabf7d3bedd6473f809ff93cfca73750ae07b12b984dbaf": [
            null,
            "task: customize the colors of the widget in the notes app.",
            null
        ],
        "19b0f2d1f0537d87dd631b7f6e2fb941b2ddd78db91d75c58c9b0eebe03a5177": [
            "task: change the alignment of the text in the notes to be aligned to the left.",
            "task: change the alignment of the text in the notes to left and center.",
            "task: change the alignment of the text in the notes to the left.",
            null
        ],
        "80c8894dd01fda61803f0495b6c15d7772ae5b80e449bce9fa9f211d475b9def": [
            "task: search for specific notes or diary entries.",
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null
        ]
    },
    "camera": {
        "863cb466e6a7b76e3579075348e7500c30d85b1deecbd22fd9bad4fcb02cdbfb": [
            "task: Set a timer for capturing photos or videos using the camera app.",
            "task: adjust the resolution settings of the camera.",
            "task: adjust camera settings or change camera mode",
            "task: capture a video",
            null,
            null,
            "task: switch camera from front to back or vice versa.",
            "task: capture a photo or video",
            "task: view the last media (photo or video) captured by the camera.",
            null
        ],
        "be4494fd25abe78afe86c224e86b0aba60534f39525371c837a1d3bedff9919f": [
            "task: view information about the camera app, such as version number, developer, and other details.",
            "task: customize camera settings",
            null,
            "Task: Customize the colors of the camera settings.",
            null,
            "task: customize camera settings and purchase the \"Simple Thank You\" feature.",
            null,
            "task: disable the shutter sound for the camera.",
            "Task: Customize camera settings to use volume buttons as shutter.",
            null,
            "task: customize camera settings and disable saving photo exif metadata.",
            "task: customize camera settings and disable the option to flip front camera photos horizontally.",
            "task: customize camera settings and save photos and videos to the locked DCIM folder.",
            "task: adjust the photo compression quality to 80% in the camera settings.",
            null,
            "task: customize camera settings and minimize latency for capturing photos."
        ],
        "fc63633d276f5f311e9a772a8b4c25b0d386064b8b7d22520af1e43de47529b2": [
            "task: adjust the photo compression quality to 100% in camera settings.",
            "task: adjust the photo compression quality to 95% in the camera settings.",
            "task: adjust the photo compression quality to 90% in the camera settings.",
            "task: adjust the photo compression quality to 85% in the camera settings.",
            "task: adjust the photo compression quality settings in the camera app.",
            "task: adjust the photo compression quality to 75% in the camera settings.",
            "task: adjust the photo compression quality to 70% in the camera settings.",
            "task: adjust the photo compression quality to 65% in camera settings.",
            "task: adjust the photo compression quality to 60% in the camera settings.",
            "task: adjust the photo compression quality to 55% in camera settings.",
            "task: adjust the photo compression quality to 50% in the camera settings.",
            null
        ],
        "f641a251595eb30fb76401f9d58e16b21a840b184c390915d35769c7b638e125": [
            "task: Adjust camera settings to minimize latency and maximize quality.",
            "task: Adjust camera settings to minimize latency, maximize quality, and go back to the homepage.",
            null
        ],
        "6b487e7860b4bcc2b78505508b20891f3434e16e473a55e614b91c875249e809": [
            null,
            "task: switch to the front camera and enable the flashlight mode for capturing photos or videos.",
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null
        ],
        "de630b21122c64a3fe10ecfaed57c4f75aa0ccc034c0d4f0829a1eceee1cd316": [
            null,
            null,
            null,
            null,
            "task: take a video or photo using the smartphone camera",
            null,
            null,
            null,
            null
        ],
        "f0c7d4f5cd80d174486b8bf80b9d8fdf9194087dba2597e5a56418705f1d28e1": [
            null,
            "task: rotate the last captured media",
            "task: view the properties of the last captured media.",
            "task: view the properties of the last captured media",
            "task: mark the last captured media as a favorite",
            "task: edit the last captured media",
            "task: share the last captured media",
            "Task: Delete the last captured media/photo.",
            null
        ],
        "b85c0edc1b54705cf5f91dce3d464afe475ee6043af156be966ffc0fabc49582": [
            "task: rotate the last captured media to the right.",
            "task: rotate the last captured media to the left.",
            "task: rotate the last captured media by 180º.",
            null
        ],
        "1c3d85795f30f7072b53f1c0021459dc742227f450e3f438ef74fc857a7015fe": [
            null,
            "task: rotate the last captured media to the right and save it.",
            null,
            null,
            null,
            null,
            null,
            null,
            null
        ],
        "34c71e0a523c1ff4c2a477ffecb8038723d8c79322d8aa899f938f42a0ade947": [
            null,
            null,
            null,
            null,
            "Task: Save the last captured media from the camera, rotate it to the right, and then cancel the save operation.",
            "Task: Save the last captured media from the camera, rotate it to the right, and save it with a specified file name and format.",
            null
        ],
        "32dbaff474d342fd8ca77a020b07dd99a3fc04fbb616bbc641d0d4524504d0a7": [
            null,
            "task: resize the last captured media and confirm overwriting the existing file.",
            "task: resize the last captured media and confirm overwriting existing file.",
            null
        ],
        "cc08f33bcb26b46c31defd9712cc902dc9c63c7ea5f6bf78c682b5f56631646c": [
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            "task: view the GPS coordinates of the last captured media on the camera.",
            "task: Remove EXIF data from the last captured media in the camera.",
            "task: view and manage the properties and details of the last captured media/photo on the camera.",
            null
        ],
        "90b09a315edf7d063855fd669828d16be6f1d47b81efdcf37319cc93dff0da22": [
            "task: rename the last captured media",
            "task: hide the last captured media",
            "task: Copy the last captured media to another location or device.",
            "task: move the last captured media to a different location or folder.",
            "task: create a shortcut for the last captured media in the camera app.",
            "task: Open the last captured media with another app.",
            "task: Set the last captured media as something (e.g., wallpaper, profile picture, etc.)",
            "task: change the orientation of the last captured media (photo or video).",
            "task: print the last captured media.",
            "task: resize the last captured media",
            "task: view the location where the last captured media was taken.",
            "task: create a slideshow with the last captured media",
            "task: customize camera settings and manage photos and videos with various options.",
            null
        ],
        "6c8e1a983c6456180e0e8c4c514aa3236dfe185cacca71a4c1c348ba9d9bab82": [
            null,
            null,
            null,
            "task: rename the last captured media file and then cancel the renaming process.",
            "task: rename the last captured media file on the smartphone.",
            null
        ],
        "ae571e20fdff6720466325a2e400ba95cfa8709d8a6d312291e51667a17b4213": [
            null,
            "task: Copy the last captured media to the DCIM/6 folder.",
            "task: move the last captured media to a different folder in the camera app.",
            "task: Copy the last captured media to a different destination folder.",
            "task: Copy the last captured media to a different folder.",
            null
        ],
        "36b957c9a6eae7a6c86933c9f6b9b384c0b5247c5767a8afe535816879658cb5": [
            null,
            "Task: Copy the last captured media to an internal folder.",
            "Task: Copy the last captured media to a specific folder in the DCIM directory.",
            "Task: Copy the image \"pic1.jpg\" to another folder.",
            "Task: Copy the image \"pic2.jpg\" to another folder.",
            "Task: Copy the image \"pic3.jpg\" to another folder.",
            "Task: Copy the video file \"video1.mp4\" to another folder.",
            "Task: Copy the video \"video2.mp4\" to another folder.",
            "Task: Copy the video \"video3.mp4\" to another folder.",
            null,
            null,
            null
        ],
        "6919cfa097bb6dc5bcc70b3a04c75500aeb04e8db499b49ba0c033318894e3aa": [
            null,
            "task: Move the last captured media from the camera app to an internal folder.",
            "Task: Select a storage location for the camera app and navigate back to the previous screen.",
            null
        ],
        "f4e3bb56b18f61edcbc485302f7614a0c5ba2e590c7ce1e15e06c3272314ca1e": [
            null,
            "task: Copy the last captured media to an internal folder or an SD card.",
            "task: Move media files from the camera to the internal storage folder in the smartphone.",
            "task: Copy the last captured media from the camera to the internal storage folder on the smartphone.",
            "task: Move an audiobook from the internal storage to a specific folder in the smartphone's camera app.",
            "task: Copy media from the camera to an internal folder in the smartphone.",
            "task: Move media from the camera app to the internal storage or a specific folder in the smartphone.",
            "task: Download media from the camera app and save it to the internal storage folder.",
            "task: Move or copy media files from the camera app to the internal storage or a specific folder.",
            "task: Move media files from the camera app's internal storage to the SD card.",
            "task: Copy media files from the camera to the internal storage folder in the smartphone.",
            "task: Copy the last captured media to an internal folder and enable notifications for new media.",
            null,
            null,
            null,
            "task: Move or copy media files from the camera app to the internal storage folder.",
            "task: Move media files from the camera to the internal storage folder in the smartphone.",
            "task: Move media files from the camera app to the internal storage or SD card.",
            null
        ],
        "2ce0ce5ef5b07019e9729194e7323bdc87877c36b8a4cd55f2427edd27789449": [
            null,
            null,
            null,
            null,
            "Task: Add camera app to home screen.",
            "Task: Add the camera app to the home screen with the option to create a shortcut automatically.",
            null
        ],
        "3b13d8a611db53137d69c3ee8372b669241dbde6b3bf434a38222a30cfcf561e": [
            null,
            "task: Change the camera orientation settings to force portrait mode and navigate back to the previous screen.",
            "task: Change the camera orientation to landscape mode and navigate back to the previous screen.",
            "task: change the camera orientation settings and go back to the previous screen.",
            null
        ],
        "d8dc4abb0e56e5f4a2054cebed843fab68f8accaf9b3302aefe20c7e5204846d": [
            "Task: Print the last captured media with customizable settings and options.",
            "Task: Save the last captured media as a PDF with customizable settings and options.",
            "Task: Print the last captured media with 1 copy and paper size set to Letter.",
            "Task: Print the last captured media as a PDF with customizable settings and options.",
            "Task: The user is trying to capture and save the last captured media as a PDF with customizable settings and options.",
            null
        ],
        "7dbda301e5283dc4e2bd19349c209d758878021484254956b28096bf83dfa517": [
            null,
            null,
            "task: Save the last captured media as a PDF file and view it in list view.",
            "task: Save the last captured media as a PDF file and view the file's directory structure.",
            null,
            "task: Save the last captured media to a new folder and print it as a PDF.",
            null,
            null,
            null,
            null,
            null,
            "task: Save the last captured media as a PDF file and print it.",
            null
        ],
        "05439376b08f3a4ec00debd52cc232b6c91e797fb80d5bf7d6a66a19f97a3e2c": [
            null,
            null,
            null,
            null,
            null,
            null,
            "Task: Resize the last captured media.",
            "Task: Resize the last captured media (photo) and save it with a customizable file name and location.",
            null
        ],
        "33122048a244f8c47e311dd09b072b0e93656461a2388359aa9c570f3966d7e5": [
            null,
            null,
            "task: view a slideshow of the last captured media with animation slide.",
            "task: View a slideshow of the last captured media, including videos.",
            "task: View a slideshow of the last captured media, including GIFs.",
            "Task: Create a slideshow with the last captured media in random order.",
            "Task: View a slideshow of the last captured media and configure settings for the camera.",
            "Task: View the last captured media in a slideshow with the option to loop the slideshow.",
            "task: view a slideshow of the last captured media.",
            "task: View a slideshow of the last captured media.",
            null
        ],
        "56d9874580c990f0b25ed9f97f016ca4c96074345486857b324b273934397964": [
            null,
            "Task: View and edit the last captured media/photo using the basic editor and gallery tools.",
            "Task: View and edit the last captured media/photo using various editing tools.",
            "Task: Edit a recently captured photo by drawing on it using the draw tool.",
            "Task: Markup a recently captured media/photo.",
            "Task: View and edit the last captured media/photo using various editing tools.",
            "Task: View the last captured media, edit the photo using various tools such as gallery, basic editor, photos, draw, and markup, and set the edited photo as the default option.",
            null
        ],
        "9204fffe58de3098a45867317f113f5217e9e0dc90b978efb2bc2b8b78ece344": [
            null,
            "task: delete the last captured media/photo.",
            "task: delete the last captured media/photo.",
            "task: delete the last captured media/photo.",
            null
        ]
    },
    "applauncher": {
        "3f9adbf098ff69152b801042222f25ddd612674644e5d20b4c3617b4c9e33b3f": [
            null,
            "task: Sort the smartphone apps by a specific criteria.",
            "task: toggle the visibility of app names on the smartphone app launcher.",
            "task: toggle visibility of smartphone apps",
            "task: access the calendar",
            "task: take a photo using the smartphone's camera.",
            "task: set an alarm on the clock app.",
            null
        ],
        "7bd9e2ded8ae3ec34dffeefb946dad82da73e3a8c7d983d8eed62b7ba2093beb": [
            null,
            "task: customize the display order and direction of app launcher by sorting apps by a different criteria",
            "task: Sort and customize the display order and direction of app launcher.",
            "task: Sort the app launcher display order and direction in descending order.",
            "task: Sort the app launcher display order and direction in descending order.",
            "task: Sort and customize the app launcher display order and direction.",
            "task: Sort and customize the display order and direction of app launcher.",
            null
        ],
        "608e4b67482f27cc24df23c888549061dafa15a7d52121e7ffa8c674b43df46a": [
            null,
            null,
            null,
            null,
            null
        ],
        "ca19303f69337e3b0304675f3593b6929a8f5e20f11c851c7caa0c01e2149f4c": [
            "Task: Adjust the column count settings in the app launcher interface.",
            "Task: Access and modify the settings and preferences of the applauncher app.",
            "Task: Access information and settings about the app.",
            null
        ],
        "e85b04a69566e4dc7f6043bd6ddb896899f3bcc27abca6f9d2d938f92e1c79f2": [
            "task: customize the number of columns for the app launcher interface.",
            "task: customize the number of columns for the app launcher interface.",
            "task: customize the number of columns for the app launcher interface.",
            "task: customize the number of columns for the app launcher interface.",
            "task: customize the number of columns for the app launcher interface.",
            "task: customize the number of columns for the app launcher interface.",
            "task: customize the number of columns for the app launcher interface.",
            "task: customize the number of columns for the app launcher interface to display 8 columns.",
            "task: customize the number of columns for the app launcher interface.",
            "task: customize the number of columns for the app launcher interface to display 10 columns.",
            "task: customize the number of columns for the app launcher interface to display 11 columns.",
            "task: customize the number of columns for the app launcher interface to display 12 columns.",
            "task: customize the number of columns for the app launcher interface.",
            "task: customize the number of columns for the app launcher interface.",
            "task: customize the number of columns for the app launcher interface.",
            null
        ],
        "c1b06bce7e23dd13a3288977fbdd55b3d1962a9bb93432a712321fd371f52bb7": [
            null,
            null,
            "task: customize the colors of the app and manage general settings.",
            null,
            "task: disable the option to close the app when launching a different one.",
            null
        ],
        "06d12a81a984d165f6107d52300085d901815170a2c6546fc7129a5ff30b88da": [
            null,
            "task: change the app's color theme to dark mode.",
            "task: change the text color of the app's interface.",
            "task: change the background color of the app.",
            "task: change the primary color of the app's interface.",
            "task: change the app icon color in the settings to customize the app's colors and theme.",
            null
        ],
        "db8da4c4aed69c1ee76c3c58386edc9a9b8924ab9d096893dc87ae36659c73bb": [
            null,
            "task: customize the color theme of the app to dark mode.",
            null
        ],
        "ee4bc85165d8e30eb0e6662bbd800d46bbbc7663b2262c79288c29040a6fb67d": [
            "task: customize the app appearance by selecting a dark theme and disabling auto light/dark mode.",
            "task: customize the app appearance by selecting the dark theme and unchecking the light theme.",
            "task: Change the app appearance settings to a light theme.",
            "task: customize the app's appearance by selecting a dark theme with dark red color.",
            "task: Change the app theme to dark and uncheck the option for white color.",
            "task: customize the app appearance by selecting the dark theme and enabling the \"Black & White\" option.",
            "task: customize the app's appearance by selecting a dark theme and enabling the custom color option.",
            null
        ],
        "9b2ba9dc53a7270e73d743ee3edc4b225c224707db6116752f993347fa8eccd6": [
            null
        ],
        "863cb466e6a7b76e3579075348e7500c30d85b1deecbd22fd9bad4fcb02cdbfb": [
            "task: Take a photo or record a video using the camera app with the timer mode enabled.",
            "task: adjust camera resolution settings.",
            "task: adjust camera and media capture settings",
            "task: Capture a video using the smartphone's camera.",
            null,
            null,
            "task: switch between front and back camera while using the camera app.",
            "task: take a photo or capture a media using the smartphone camera.",
            "task: view the last media captured using the smartphone's camera.",
            null
        ],
        "fb78df2efd2d0dae6fe2d27fc76d3c48cf2944110abca15ccb49178d2e962f30": [
            "task: explore more apps from the app launcher and manage app settings",
            "task: adjust clock settings and manage alarm and timer settings.",
            "task: view information about the Clock app and its features.",
            "task: set an alarm for 5:00 AM.",
            "task: set a new timer.",
            null,
            "task: set a new alarm on the smartphone.",
            "task: start the stopwatch and track time.",
            null,
            null
        ]
    },
    "firefox": {
        "8296582e793e9f504816578383d9d54e13b7fac650c9089e45589743940ebf27": [
            "task: Start browsing the internet in private mode.",
            null,
            "task: search for something on Google",
            null,
            "task: switch to a different tab in the Firefox browser.",
            "task: access the menu options for web browsing in private mode, search, switch tabs.",
            null
        ],
        "39180632bed6820472c6b99209b673b6fc599e7f661164ee753d0964854383bf": [
            "task: access and manage bookmarks in Firefox.",
            "task: view browsing history",
            "task: access and manage downloaded files",
            "task: install or manage add-ons/extensions on Firefox.",
            "task: sync and save data on Firefox.",
            "task: manage account and devices",
            "task: enable desktop site view in Firefox browser.",
            "task: check for new updates or features in the Firefox browser.",
            "task: access help and support for Firefox browser.",
            "task: customize the homepage of Firefox.",
            "task: customize browser settings",
            null
        ],
        "7c090f40f597064832b6328c6a9714b8e9f0006bca4a73f1b0cb710570464e23": [
            "task: navigate to a bookmarked page",
            null,
            "task: search for a specific bookmark or website using the search terms.",
            "task: add a new folder to the bookmarks section in Firefox.",
            "task: close the bookmarks menu.",
            "task: access desktop bookmarks in the Firefox browser.",
            null
        ],
        "104c27bf48e99d8da8bde6090a1edcaf7e476367e180b46f7edda9d42773388b": [
            "task: view browsing history and search terms, navigate to a previous webpage.",
            null,
            "task: search for a specific term in browsing history and navigate between tabs.",
            "task: delete browsing history and search terms in Firefox.",
            "task: view recently closed tabs in browsing history.",
            null,
            null
        ],
        "83bfae0a61a87ae805d3df7ea7213bb7d4221ed3f5ef687909821dda60f924da": [
            null,
            null,
            "task: view recently closed tabs and close one of them.",
            "task: view the full history of recently closed tabs.",
            null,
            null
        ],
        "d2e60c5decfa833a162aebf7333ba672e85db064fa107a02b7c0b8ae9fb00c4c": [
            "task: Install or manage add-ons/extensions on Firefox.",
            null,
            null,
            null,
            null
        ],
        "80e74c20ca3cfc5fd7050f4dd97f8a288470467c68ceab6363d903d403fdff15": [
            "task: Sync and save data",
            null,
            null,
            null,
            "task: Sync and save data from the smartphone to another device or account.",
            "task: Switch from using a Firefox account to using an email account for syncing and saving data.",
            "task: Create a Firefox account to sync data between devices.",
            null
        ],
        "9586e9a07306129f3fc13eca8c84640f49bdc3dca12076a3217967cf476ed209": [
            "task: access account and device management settings",
            "task: view site information for a specific website",
            "task: manage account and devices settings on the Firefox website.",
            "task: switch to a different tab in Firefox.",
            "task: access account and device management settings",
            null
        ],
        "69bfe8927dc1d83a03d6fb09c17a6762a4144d228526f8b1946eb05489afe52c": [
            null,
            null,
            null,
            "task: access and manage Firefox account settings on the accounts.firefox.com.cn website.",
            null,
            null,
            null
        ],
        "17d6b2bb5b89a8227aa57f4aaa74dc54514beacf47a1765f3cb4307184c34ff0": [
            null,
            null,
            null,
            "task: navigate to account settings and manage account and devices in Firefox.",
            null,
            "task: Set up or manage Firefox account settings, sync, tabs, and site information.",
            "task: navigate to the previous page or close the Firefox account settings interface.",
            "task: Sign up or sign in to their Firefox account.",
            "task: Access and manage Firefox account settings, sync, tabs, and site information.",
            null,
            null,
            null,
            null,
            null,
            null
        ],
        "21bf3b53883c2c81331e82edab397e6231bcf89a73dd5ae073bd30a819402b6b": [
            null,
            "task: navigate to the homepage and dismiss a notification or pop-up.",
            null
        ],
        "f3d7cb40b3b3071657693853ce8f663a37d89481d56fae1fd4076dab40a26f9c": [
            null,
            null,
            "task: view and manage recent tabs in the Firefox browser.",
            "task: manage account and devices on Firefox.",
            null,
            "task: view all past explorations in the web browsing history.",
            "task: access and manage account settings",
            "task: manage Firefox accounts and devices",
            null,
            null,
            null,
            null,
            "task: switch to a different tab in the Firefox browser.",
            null,
            null
        ],
        "acef8d4ff4cd6417a7a0cf630bd8753306c1fea49b523c5eb08be56957fb3e6e": [
            "task: navigate back to the previous page or section within the browser settings menu.",
            null,
            "task: sign in to sync tabs, bookmarks, passwords, and more for the Firefox browser.",
            "task: enable domestic China service for browsing",
            null,
            "task: change the default search engine to Google.",
            "task: change the settings for tab closing method in Firefox.",
            "task: Change the homepage settings to open a specific webpage after four hours.",
            "task: customize browser settings and preferences",
            "task: manage and view saved logins and passwords in the Firefox browser.",
            "task: enable or disable autofill feature in Firefox browser.",
            "task: adjust accessibility settings for the Firefox browser.",
            null,
            "task: change the language settings of the Firefox browser.",
            "task: Set Firefox as the default browser on the smartphone.",
            null,
            "task: enable private browsing mode in Firefox.",
            "task: enable HTTPS-Only Mode in the browser settings.",
            "task: enable enhanced tracking protection in Firefox browser.",
            "task: manage site permissions for the Firefox browser.",
            "task: delete browsing data",
            "task: enable or disable the option to delete browsing data when quitting Firefox.",
            "task: enable the option to delete browsing data when quitting the browser.",
            "task: Enable or disable notifications for Firefox browser.",
            "task: adjust data collection settings for privacy and security.",
            null,
            null,
            "task: Change the browser settings to always open links in apps.",
            "task: configure the external download manager settings for the Firefox browser.",
            "task: enable remote debugging via USB for Firefox browser.",
            null,
            "task: rate the Firefox app on Google Play.",
            "task: check the version and information about Firefox browser."
        ],
        "3710ff8a611a5b0a56c8e79993bad55cb24d289dd99aa9a3d8cc3420d70f7799": [
            null,
            null,
            null,
            "task: Close multiple tabs manually and view a list of all open tabs.",
            "task: Close tabs manually and change tab view settings in Firefox.",
            null,
            "task: Adjust tab settings to prevent tabs from closing automatically.",
            "task: manage tab settings, close tabs manually, and move old tabs to inactive after one day.",
            "task: manage tab settings, close tabs manually, and move old tabs to inactive after one week.",
            "task: manage tab settings, close tabs manually, and move old tabs to inactive after one month.",
            null,
            "task: manage tab settings, close tabs manually, and configure tabs to be moved to inactive after two weeks",
            null
        ],
        "7a817b721d1abfd6c27bfde5f105932dcea6ae150b78ccd945861b17390b83b9": [
            "task: navigate back to the previous page or section in the Firefox settings menu.",
            null,
            "task: sign in to sync tabs, bookmarks, passwords, and more.",
            "task: Enable or disable the use of domestic China service in the Firefox browser.",
            null,
            "task: change the default search engine to Google.",
            "task: close tabs manually",
            "task: Change the homepage settings to open a specific webpage after four hours.",
            "task: customize browser settings and preferences",
            "task: manage and view saved logins and passwords in the Firefox browser.",
            "task: enable or disable autofill feature in Firefox browser.",
            "task: adjust accessibility settings for the Firefox browser.",
            null,
            "task: change the language settings of the Firefox browser.",
            "task: Set Firefox as the default browser on the smartphone.",
            null,
            "task: Enable private browsing mode in Firefox.",
            "task: enable HTTPS-Only Mode in the browser settings.",
            "task: enable enhanced tracking protection in Firefox browser.",
            "task: manage site permissions for the Firefox browser.",
            "task: delete browsing data",
            "task: enable the option to delete browsing data when quitting the Firefox browser.",
            "task: Enable or disable notifications for the Firefox app.",
            "task: adjust data collection settings for privacy and security.",
            null,
            null,
            "task: change the browser settings to always open links in apps.",
            "task: configure the external download manager for the Firefox browser.",
            "task: enable remote debugging via USB for Firefox browser.",
            null,
            "task: rate the Firefox app on Google Play.",
            "task: check the version and information about Firefox."
        ],
        "7ac99f8e17b8d9e13aa055ac0533f85e18a6ea7df2ef8ee29c53ffb5beb2f0d7": [
            null,
            null,
            "task: customize homepage settings and shortcuts on Firefox.",
            "task: Customize the homepage settings and access sponsored shortcuts.",
            "task: Set the homepage to open automatically after four hours of inactivity.",
            "task: customize homepage settings and access recently visited bookmarks.",
            "task: Change the homepage settings to open a specific page after four hours.",
            "task: Change the homepage settings to open thought-provoking stories articles after four hours.",
            "task: customize homepage settings and enable sponsored stories for future browsing.",
            "task: Change the homepage settings and select a new wallpaper for the Firefox browser.",
            null,
            "task: set the homepage to open after four hours of inactivity.",
            "task: Change the homepage settings to open a specific page after four hours and then navigate to the last tab.",
            "task: Set the homepage to open automatically after four hours of inactivity.",
            null
        ],
        "75b4096ac559e61f8a19bd20f19660a789b1a32611dcba620406f7b6f472c123": [
            null,
            null,
            "task: Change the homepage settings to open a specific page after four hours of inactivity.",
            null,
            null,
            null,
            null,
            null,
            null,
            null
        ],
        "111550fe29e239939d7015ce2189b06981f0b80efaddad581b0b25e2f806e330": [
            null,
            null,
            "task: view information about Firefox, such as version and release notes.",
            null,
            "task: check the version and details of the Firefox app.",
            "task: check the version and release date of Firefox app.",
            "task: view the latest updates and changes in the Firefox app.",
            "task: access support and view information about Firefox app",
            "task: view information about crashes in the Firefox app.",
            "task: view the privacy notice and licensing information for the Firefox app.",
            "task: access and read the privacy and licensing information for the Firefox app.",
            "task: view licensing information for the Firefox app.",
            null,
            "task: view information about the libraries used in the Firefox app."
        ],
        "a8750527c321a3ae405ea4e80bc1befaff23d480861e53e2833f5862631870e9": [
            null,
            null,
            "task: change the language settings in the Firefox app.",
            "task: change the language settings in the Firefox app to English (United States) based on the device language.",
            "task: change the language settings in the Firefox app to Albanian.",
            "Task: Change the language settings in the Firefox app to Amharic (አማርኛ).",
            "task: change the language settings in the Firefox app to Arabic.",
            "task: change the language settings in the Firefox app to Aragonese.",
            "Task: Change the language settings in the Firefox app to Armenian (Armenia).",
            "task: change the language settings of the Firefox app to Asturianu (Asturian).",
            "Task: Change the language settings in the Firefox app to Azerbaijani (Azərbaycan).",
            "task: change the language settings in the Firefox app to Balinese.",
            "task: change the language settings of the Firefox app to Bengali (বাংলা).",
            "task: change the language settings in the Firefox app to Euskara (Basque).",
            "task: change the language settings in the Firefox app to Belarusian.",
            "task: change the language settings in the Firefox app to Bosnian.",
            "task: change the language settings in the Firefox app to Breton (Brezhoneg).",
            null,
            "task: change the language settings in the Firefox app to Basque.",
            "task: change the language settings to English (United States) in the Firefox app.",
            "task: change the language settings of the Firefox app to Bulgarian.",
            "task: change the language settings of the Firefox app to Burmese (မြန်မာ).",
            "task: change the language settings of the Firefox app to Catalan.",
            "task: Change the language settings in the Firefox app to Binisaya (Cebuano).",
            "task: change the language settings in the Firefox app to Tamaziɣt n laṭlaṣ (Central Atlas Tamazight).",
            "task: change the language settings in the Firefox app to Central Kurdish (کوردیی ناوەندی).",
            "task: change the language settings of the Firefox app to Chinese (Simplified Han).",
            "task: change the language settings in the Firefox app to Chinese (Traditional Han).",
            "task: change the language settings in the Firefox app to Kernewek (Cornish).",
            "task: Change the language settings in the Firefox app to Corsican.",
            "task: change the language settings in the Firefox app to Croatian.",
            "task: change the language settings in the Firefox app to Czech.",
            "task: change the language settings in the Firefox app to Danish (Dansk).",
            "task: change the language settings of the Firefox app to Dutch.",
            "task: change the language settings in the Firefox app to English (Canada).",
            "task: Change the language settings in the Firefox app to English (United Kingdom).",
            "task: change the language settings of the Firefox app to Esperanto.",
            "task: change the language settings of the Firefox app to Estonian.",
            "task: change the language settings in the Firefox app to Finnish.",
            "task: change the language settings of the Firefox app to French.",
            "task: change the language settings of the Firefox app to Furlan (Friulian).",
            "task: change the language settings in the Firefox app to Pulaar/Fulah.",
            "task: change the language settings in the Firefox app to Galego (Galician).",
            "task: change the language settings of the Firefox app to Georgian.",
            "task: change the language settings in the Firefox app to German.",
            "task: change the language settings of the Firefox app to Greek.",
            "task: change the language settings in the Firefox app to Guarani.",
            "Task: Change the language settings in the Firefox app to Gujarati (India).",
            "task: change the language settings in the Firefox app to Hebrew.",
            "task: change the language settings in the Firefox app to Hiligaynon.",
            "task: change the language settings in the Firefox app to Hindi (India).",
            "task: change the language settings in the Firefox app to Gujarati (India).",
            "task: change the language settings of the Firefox app to Hungarian.",
            "task: change the language settings of the Firefox app to Icelandic (Íslenska).",
            "task: Change the language settings of the Firefox app to Indonesian.",
            "task: change the language settings to Interlingua in the Firefox app.",
            "task: change the language settings in the Firefox app to Irish (Ireland) (Gaeilge (Éire)).",
            "task: change the language settings of the Firefox app to Italiano (Italian).",
            "task: change the language settings in the Firefox app to Japanese.",
            "task: change the language settings in the Firefox app to Taqbaylit Kabyle.",
            "task: Change the language settings in the Firefox app to Kannada (ಕನ್ನಡ).",
            "task: change the language settings in the Firefox app to Kara-Kalpak.",
            "task: Change the language settings in the Firefox app to Kazakh.",
            "task: change the language settings in the Firefox app to Kazakh (Қазақ тілі).",
            "task: change the language settings of the Firefox app to Korean.",
            "task: Change the language settings in the Firefox app to Lao.",
            "task: change the language settings in the Firefox app to Ligurian.",
            "task: change the language settings in the Firefox app to Lithuanian.",
            "task: change the language settings in the Firefox app to Dolnoserbšćina (Lower Sorbian).",
            "task: Change the language settings in the Firefox app to Malayalam.",
            "Task: Change the language settings in the Firefox app to Marathi.",
            "task: change the language settings of the Firefox app to Nepali (Nepal).",
            "Task: Change the language settings in the Firefox app to Norwegian Bokmål (Norway).",
            "Task: Change the language settings in the Firefox app to Norwegian Nynorsk (Norway).",
            "task: change the language settings in the Firefox app to Marathi.",
            "task: change the language settings of the Firefox app to Occitan.",
            "task: change the language settings in the Firefox app to Odia (Oriya).",
            "task: change the language settings of the Firefox app to Persian (فارسی).",
            "Task: Change the language settings in the Firefox app to Polish.",
            "task: change the language settings of the Firefox app to Portuguese (Brazil).",
            "task: change the language settings of the Firefox app to Portuguese (Portugal).",
            "task: change the language settings to Punjabi (India) in the Firefox app.",
            "task: change the language settings in the Firefox app to Punjabi (Pakistan).",
            "task: change the language settings of the Firefox app to Romanian.",
            "task: change the language settings in the Firefox app to Rumantsch Romansh.",
            "task: change the language settings in the Firefox app to Russian.",
            "task: change the language settings in the Firefox app to Russian."
        ],
        "d3f7619910030a1d9c5401fda56c10f780691a537fd34cc6aed5c6a238d34073": [
            null,
            null,
            null,
            null,
            "task: enable HTTPS-Only Mode in Firefox with the option to enable it in all tabs.",
            "task: enable HTTPS-Only Mode in Firefox with the option to enable it only in private tabs.",
            null
        ],
        "e8e207edb99e1ee3f917a357e34c26729f529b7f89b9ab87b27a7a35fbc71bdf": [
            null,
            "task: set Firefox as the default browser instead of Chrome.",
            "task: set Firefox as the default browser app.",
            "task: Set Firefox as the default browser app in the WebView Shell.",
            "task: change the default browser app to Firefox.",
            "task: set Firefox as the default browser app.",
            null
        ],
        "51c62413af049e1da6c2785664d56b8cf8dcc04fb394ff198c9b9641b6196b8b": [
            null,
            null,
            "task: Set Firefox as the default browser app on the smartphone.",
            null,
            null,
            null,
            null
        ],
        "5d892ccb2dc3a399035baec1546bb331ae9d36000df429cc13b7cf8205f51417": [
            null,
            null,
            "task: Set Firefox as the default browser on the smartphone.",
            "task: set Firefox as the default browser on the smartphone.",
            "task: Set Firefox as the default browser and manage the Caller ID & spam app settings.",
            "task: set Firefox as the default browser and set Google as the default digital assistant app.",
            "task: Set Firefox as the default browser on the smartphone.",
            "task: Set Firefox as the default browser on the smartphone.",
            "task: Set Firefox as the default browser and set SMS Messenger as the default SMS app.",
            "task: Set Firefox as the default browser for opening links on the smartphone.",
            null
        ]
    },
    "dialer": {
        "36d9d3b201880926045a3f8ce61c43793956327bde63025e6ebeb56aacd079e4": [
            null,
            "task: sort the contacts or call history by a specific criterion.",
            "task: filter and search for specific contacts or call history.",
            "task: create a new contact",
            "task: access additional options in the dialer app.",
            "Task: Call Alice",
            "task: call/contact Bob",
            "task: call Jack",
            "Task: Create a new contact and access additional options.",
            "task: make a phone call",
            null,
            "task: add a contact to favorites.",
            "task: view call history, search, sort, filter, create new contact, or access additional options.",
            null
        ],
        "b1a00fd39b48c98523831f52dca1e27884000b421faf80ee89f5ecac04481894": [
            null,
            "Task: Sort contacts by first name in ascending or descending order.",
            "Task: Sort contacts by name, including middle name, in ascending or descending order.",
            "Task: Sort contacts by surname in ascending or descending order.",
            "Task: Sort contacts by name in descending order.",
            "Task: Sort contacts by date created in ascending or descending order.",
            "task: sort contacts by name in descending order.",
            "Task: Sort contacts in descending order by name or date created.",
            "task: sort contacts by a specific criteria (name, date created) and order (ascending/descending) and then cancel the sorting operation.",
            "task: sort contacts by a specific criteria (name, date created, or order) and confirm the sorting choice.",
            null
        ],
        "5d41ba4ba4a32d9fb05ea4b994f56fbf3f8e3cd2f82b62049581a8e736e91938": [
            "task: Filter and exclude phone storage from being visible to other apps.",
            "task: apply a filter to the dialer's call log and then cancel the filter.",
            "task: apply a filter to the dialer's call log and confirm the selection.",
            null
        ],
        "77583b11ad5633cfffda3a1c606f2b82cf5edbe5739d839f74bfd29973528d44": [
            "task: customize app settings and view app information.",
            "task: view app information and navigate app settings",
            null
        ],
        "b6bf6a602f0f077f9d35ec740ca71a92dac5e0c34e6c4b74e58bec149547eef3": [
            null,
            null,
            "Task: Customize the colors of the dialer app.",
            null,
            "task: Unblock a previously blocked phone number.",
            "task: change the date and time format on the smartphone.",
            "Task: Add or remove contacts from the speed dial list.",
            "task: change the font size to large in the dialer app.",
            "task: customize the app settings to start names with surnames.",
            "task: Hide dialpad numbers in the dialer app settings.",
            "task: disable vibrations when clicking on the dialpad buttons.",
            "task: disable the sound effect when pressing buttons on the dialpad.",
            null,
            null,
            "task: Customize the shown tabs in the dialer app.",
            "Task: Customize the app settings to set the tab that opens at app start to the last used one.",
            "task: Set the dialpad to open by default when the app is opened.",
            null,
            "task: disable grouping of subsequent calls with the same number in the call settings.",
            "task: enable the call confirmation dialog before making a call.",
            "Task: Disable the proximity sensor during calls.",
            "task: customize call settings to replace swiping at responding to incoming calls with another option.",
            "task: customize call settings to always display incoming calls on full screen."
        ],
        "06d12a81a984d165f6107d52300085d901815170a2c6546fc7129a5ff30b88da": [
            null,
            "task: change the color theme of the dialer app to dark mode.",
            "task: change the text color for the smartphone app dialer.",
            "task: change the background color of the smartphone app dialer.",
            "task: change the primary color of the smartphone app dialer.",
            "task: change the app icon color for the smartphone app dialer.",
            null
        ],
        "db8da4c4aed69c1ee76c3c58386edc9a9b8924ab9d096893dc87ae36659c73bb": [
            null,
            "task: change the theme of the dialer app to dark mode.",
            null
        ],
        "ee4bc85165d8e30eb0e6662bbd800d46bbbc7663b2262c79288c29040a6fb67d": [
            "Task: Customize the light and dark theme settings for the app dialer.",
            "Task: Customize the light and dark theme settings for the app dialer.",
            "Task: Change the app dialer theme to light mode.",
            "Task: Customize the color theme of the app dialer to use a dark red color.",
            "Task: Customize the color theme of the dialer app to a dark theme with white text.",
            "Task: Customize the color theme of the dialer app to a dark theme and enable the \"Black & White\" option.",
            "Task: Customize the color theme of the dialer app to a dark theme.",
            null
        ],
        "38f20a5a0962efc75d9613829202b95fe5ef87cfa5fa89065feee5702f3b670a": [
            null,
            "task: add a number to the blocked list for call blocking on the smartphone app.",
            null,
            "task: block calls from contacts that are not stored in the smartphone's contacts list.",
            null,
            "task: Add a number to the blocked list for call blocking on the smartphone app.",
            null
        ],
        "8cb53267caec91fabbc33f0d955e0bf2bf6cc77828de61266c59a8cd30a73e28": [
            null,
            null,
            "task: add a number to the blocked list to prevent calls and messages from that number.",
            "task: block a specific number from making calls or sending messages.",
            null
        ],
        "79ce56cc2b386505c9ed8324558fd8c9ca8fee60fc8ad3d62bb3c59b081f7731": [
            null,
            "Task: Set the default caller ID and spam app to block calls from not stored contacts.",
            "task: block calls from not stored contacts in the dialer settings.",
            "task: manage blocked numbers and enable blocking calls from not stored contacts.",
            "task: Set the default caller ID and spam app to block calls from contacts that are not stored.",
            null
        ],
        "e521940b04cc341765eac82253ed8f43e5161313a96e56f65c123833a814fcd2": [
            null,
            null,
            "task: Set default caller ID and spam app settings to block calls from non-stored contacts on the dialer interface.",
            null,
            null,
            null
        ],
        "e4bc83f77703f52d07cd5f9ca5fb500d16741aefd16d4f6f35002bd13525c940": [
            "task: change the date and time format on the smartphone.",
            "Task: Change the date and time format on the smartphone.",
            "Task: Change the date and time format on the smartphone.",
            "task: change the date and time format on the smartphone.",
            "Task: Change the date and time format on the smartphone.",
            "Task: Change the date and time format on the smartphone to display as \"2021-02-16\".",
            "Task: Change the date and time format to display as \"16 February 2021\" on the smartphone.",
            "task: change the date and time format to display February 16, 2021.",
            "Task: Change the date and time format to use a 24-hour time format.",
            "task: change the date and time format on the smartphone.",
            "task: change the date and time format on the smartphone.",
            null
        ],
        "605651ace5ef6b2bbf205f73985e66b218ff175c27c27dbe0bc41a7f55eaa08a": [
            null,
            null,
            "task: add a new contact to the speed dial list.",
            "task: edit or update the speed dial contact for the number 2.",
            "task: Edit or remove the speed dial contact assigned to the number 3.",
            "task: edit or update the speed dial contact labeled as \"4\" on the smartphone's dialer interface.",
            "task: Add a new contact to the speed dial list.",
            "task: Edit or delete the speed dial contact assigned to number 6.",
            "task: Edit or remove the speed dial contact assigned to the number 7.",
            "task: Edit or remove the speed dial contact assigned to the number 8.",
            "task: Edit or remove the speed dial contact assigned to the number 9.",
            null
        ],
        "0c705b9a74f692e6c4feab6b9d9f9b1b992876e5272ee28d4c03a00597b4ae41": [
            "task: adjust the font size of the app dialer interface to large and uncheck the option for small font size.",
            "task: adjust the font size of the app dialer interface to medium and navigate back to the homepage.",
            "task: adjust the font size of the app dialer interface and navigate back to the settings page.",
            "task: adjust the font size of the app dialer interface to \"Extra large\" and navigate back to the homepage.",
            null
        ],
        "acf9620fcbecde1976e6768be87d9f561d9e1c7eefbad7fba1a665735cff0e09": [
            "task: Hide contacts from being shown in the dialer's interface.",
            "task: Remove the \"Favorites\" tab from the dialer's homepage.",
            "task: hide call history from the displayed tabs in the phone app.",
            "task: customize the tabs shown on the dialer homepage.",
            "task: customize the tabs shown on the dialer interface.",
            null
        ],
        "ccc9d9093adc8eee90eaa7f9081089d8c62c45aed859c6d1e3074fcb25a24071": [
            "task: add a new contact and change the photo for the newly created contact.",
            "task: create a new contact and mark it as a favorite.",
            null,
            null,
            null,
            "Task: Create a new mobile contact.",
            null,
            "Task: Create a new contact and return to the homepage.",
            null,
            "Task: Create a new contact with unknown information.",
            "Task: Add a new contact with birthday information.",
            "task: create and save a new contact.",
            null,
            null,
            null,
            "Task: Create a new contact and assign it to a group.",
            "Task: Create a new contact and save it to the phone's storage."
        ],
        "b497131bb37d355259223709b95c716efd4d28b0b2c5b00787c7eef44d8e896e": [
            "task: create a new contact with a mobile phone number and remove the label \"Mobile\" from the contact's phone number.",
            "task: create a new contact with a mobile phone number and label it as \"Home\".",
            "task: create a new contact with a mobile number and label it as work.",
            "task: create a new contact with a mobile phone number and label it as \"Main\".",
            "task: create a new contact with a mobile number and label it as a work fax.",
            "task: create a new contact with a mobile number and label it as \"Home Fax\".",
            "task: create a new contact with a mobile phone number and an unchecked pager label.",
            "task: create a new contact with a mobile number and label it as \"Other\".",
            "task: create a new contact with a custom phone number label for a mobile device.",
            null
        ],
        "bcc5460a524636adcd43bafd581c027dc236295050dd625e2ed4b0b742d543ac": [
            "Task: Create a new contact and navigate back to the homepage while unchecking the \"Home\" category.",
            "Task: Create a new contact for the \"Work\" category and navigate back to the homepage.",
            "task: create a new contact for the mobile category and navigate back to the homepage.",
            "Task: Create a new contact and navigate back to the home page while excluding the \"Other\" category.",
            "task: create a new contact and navigate back to the homepage",
            null
        ],
        "22722d2dee1335c5482c1049aa7a6dbd5e481466f1ef8b3fa3a91a34b24b329d": [
            "task: create a new contact with the name \"Unknown\" and set the birth year as 2023.",
            "task: create a new contact with an unknown name and set the birthdate to Saturday, July 1.",
            "task: create a new contact with the name \"Unknown\" and set their birthday as July 1, 2023.",
            "task: create a new contact with the name \"Unknown\" and set the birthdate as July 2, 2023.",
            "task: create a new contact with the name \"Unknown\" and set the birthdate as July 3, 2023.",
            "task: create a new contact with the name \"Unknown\" and set their birthday as July 4, 2023.",
            "task: create a new contact with the name \"Unknown\" and set their birthday to July 5, 2023.",
            "task: create a new contact with the name \"Unknown\" and set the birthdate to July 6, 2023.",
            "task: create a new contact with the name \"Unknown\" and set their birthday as July 7, 2023.",
            "task: create a new contact with the name \"Unknown\" and set their birthday to July 8, 2023.",
            "task: create a new contact with the name 'Unknown' and set their birthday to July 9, 2023.",
            "task: create a new contact with the name 'Unknown' and set their birthday as July 10, 2023.",
            "task: create a new contact with the name \"Unknown\" and set the birthdate as 11 July 2023.",
            "task: create a new contact with the name \"Unknown\" and set their birthday as July 12, 2023.",
            "task: create a new contact with the name \"Unknown\" and set their birthday as July 13, 2023.",
            "task: create a new contact with the name \"Unknown\" and set their birthday as July 14, 2023.",
            "task: create a new contact with the name \"Unknown\" and set their birthday to July 15, 2023.",
            "task: create a new contact with the name \"Unknown\" and set their birthday to July 16, 2023.",
            "task: create a new contact with the name \"Unknown\" and set their birthday to July 17, 2023.",
            "task: create a new contact with the name \"Unknown\" and set the birthdate to July 18, 2023.",
            "task: create a new contact with the name \"Unknown\" and set their birthday to July 19, 2023.",
            "task: create a new contact with the name \"Unknown\" and set the birthdate as July 20, 2023.",
            "task: create a new contact with the name \"Unknown\" and set their birthday to July 21, 2023.",
            "task: create a new contact with the name \"Unknown\" and set the birthdate as July 22, 2023.",
            "task: create a new contact with the name \"Unknown\" and set their birthday to July 23, 2023.",
            "task: create a new contact with the name \"Unknown\" and set their birthday as July 24, 2023.",
            "task: create a new contact with the name \"Unknown\" and set their birthday to July 25, 2023.",
            "task: create a new contact with the name \"Unknown\" and set their birthday as July 26, 2023.",
            "Task: Create a new contact with the name \"Unknown\" and set the birthdate as July 27, 2023.",
            "task: create a new contact with the name \"Unknown\" and set the contact's birthday to July 28, 2023.",
            "task: create a new contact with the name \"Unknown\" and set their birthday as July 29, 2023.",
            "task: create a new contact with the name \"Unknown\" and set their birthday as July 30, 2023.",
            "task: create a new contact with the name \"Unknown\" and set their birthday as July 31, 2023.",
            "task: create a new contact and navigate to the previous month in the calendar.",
            "task: create a new contact for the next month.",
            "task: create a new contact and hide the year in the phone dialer and calendar interface.",
            "task: create a new contact and then cancel the operation.",
            "task: create a new contact and confirm the creation.",
            null
        ],
        "1d44133c96356351315b0e4a555dec2dde8933d6120a3e2dd793c7d97a7f814b": [
            "task: create a new contact with a reminder for a birthday and an option to set an anniversary reminder.",
            "task: create a new contact with a birthday reminder and then remove the birthday reminder.",
            "task: create a new contact with a birthday reminder and categorize it as \"Other\".",
            null
        ],
        "aa42d6d7b1951400500e8c45aa29d226bcb19ef5818ba59d3557c3199a3c4c1f": [
            "task: create a new group in the smartphone app dialer.",
            "task: create a new contact and add it to a group in the smartphone app dialer.",
            "task: create a new contact and add it to a group in the smartphone app dialer.",
            null
        ],
        "71ad59c500ac9c66a089da0d2c9694928a6d73f57a5b16001b88eedd88f87a68": [
            "task: create a new contact and manage phone storage settings.",
            null
        ],
        "c4f2f694d4393ad28929563eab36ffcb82111106f8d4dd5e224b6efd8e344bfe": [
            "task: customize the fields shown for contacts in the smartphone app dialer.",
            null
        ],
        "b5c29ed0558462bb184cac18e589a6420d6aad11aaf9eab71ca82351e0d5f409": [
            "Task: Customize the displayed contact information by adding the prefix field and saving the changes.",
            "Task: Customize the displayed contact information by removing the \"First name\" field.",
            "Task: Customize the displayed contact information by adding the middle name field and save the changes.",
            "Task: Customize the displayed contact information by removing the surname field.",
            "Task: Customize the displayed contact information by adding a suffix to the contact's details and save the changes.",
            "Task: Customize the displayed contact information by adding a nickname to a new contact.",
            "Task: Customize the displayed contact information by removing phone numbers from the contact fields.",
            "Task: Customize the displayed contact information by unchecking the \"Emails\" field.",
            "Task: Customize the displayed contact information by removing the \"Addresses\" field.",
            "Task: Customize the displayed contact information by adding the Instant Messaging (IM) field.",
            "Task: Customize the displayed contact information by removing the option to show events (birthdays, anniversaries).",
            "Task: Customize the displayed contact information by removing the \"Notes\" field.",
            "Task: Customize the displayed contact information and save changes, specifically by adding a ringtone to a new contact.",
            "Task: Customize the displayed contact information and save the changes.",
            "Task: Customize the displayed contact information and save the changes made to the contact fields.",
            null,
            "Task: Customize the displayed contact information by adding the \"Organization\" field and save the changes.",
            "Task: Customize the displayed contact information by adding websites to the contact fields.",
            "Task: Customize the displayed contact information by removing the \"Groups\" field.",
            "Task: Customize the displayed contact information by removing the \"Contact source\" field."
        ],
        "0ca12ca4f59bd6e046754ae02e4ab0247b43b7af73a1d6d6f2d25684436f347c": [
            "task: add a new contact and change the photo for the contact.",
            "task: add a new contact and change the photo for the contact.",
            null
        ],
        "4a494442ef7fe79bad63d60f6260344632e313aeebf760de959e5860f9d4efb6": [
            "task: Change the photo of a new contact by taking a photo and accessing the app's options and settings.",
            "task: Add a new contact and change the photo by taking a new one.",
            null
        ],
        "943039d6c25fab634c24e9f36528741c4670d06236924f560f1d4ea793278930": [
            null,
            "task: add a new contact and change the photo by selecting one from the gallery.",
            "task: add a new contact and change the photo for the contact.",
            "task: create a new contact and change the photo by selecting a photo from the Photos app.",
            "task: add a new contact and change the photo for the contact.",
            "Task: Add a new contact and change the photo for the contact.",
            null
        ],
        "e131e93f5e9876af5d1d17d63a70b5a135f1dfc93972683f1af1eef3a7388748": [
            null,
            "task: add Alice as a favorite contact.",
            "task: send an email to Alice",
            "task: call Alice",
            "task: send an SMS to Alice.",
            null,
            "task: call Alice on her mobile number 111111",
            "task: send an email to Alice.",
            "task: view or manage the contacts and communication (calling, messaging, emailing) with Alice.",
            "task: edit the contact information of Alice.",
            "task: share Alice's contact information with someone",
            "task: delete contact Alice",
            null,
            null
        ],
        "bff4c730f9564da1281b8032849fbe1488161baa6216fe3721b8fa4b25b8b4af": [
            null,
            null,
            "task: Set up email for Alice by navigating through the Gmail setup process and skipping certain steps.",
            "task: Set up email for Alice by navigating through the Gmail setup process, skipping unnecessary steps, and proceeding to the next step.",
            null
        ],
        "467d921c37c70b9fd0d0f21ea8b93c3025ef4d0984d7aab6e67e6c940756c3e0": [
            "task: make a phone call to Alice and turn off the microphone during the call.",
            "task: make a phone call to Alice using the speaker and then turn off the speaker.",
            "task: make a phone call to Alice using the dialpad.",
            "task: put a call with Alice on hold.",
            "Task: Add Alice to a call and manage phone call settings.",
            "task: make a phone call to Alice and end the call.",
            null,
            null,
            null,
            null
        ],
        "428b067bee33b9f544af41f20f7740ca0d7109904f4b61cd79e50d5ea90d1f20": [
            null,
            null,
            "task: send an SMS to Alice by dialing her number.",
            "task: add Alice as a new contact and send her an SMS.",
            null,
            "task: send an SMS to Alice at 30.06, 12:18 PM.",
            "Task: Send an SMS to Alice with the message \"Hello\".",
            "task: send an SMS with an attachment to Alice.",
            null,
            null,
            null
        ],
        "03b40b6d114743d46681fa77f4a0a480dae509a2bfea2318de6a1cd4e78d586f": [
            "task: change the photo of the contact \"Alice\".",
            null,
            null,
            null,
            null,
            "task: edit the mobile number for the contact named Alice.",
            null,
            "task: edit contact information for Alice.",
            null,
            "task: edit the contact information for the contact named \"Alice\".",
            "task: edit the birthday information for the contact named Alice.",
            "task: edit and save the contact information for Alice.",
            null,
            null,
            null,
            null,
            null,
            "Task: Add Alice to a group.",
            null
        ],
        "bfab4bf7c2c7b54f18f22d052fbdf2b69462dabb826993d560228c72a672c27b": [
            null,
            "task: delete a contact named Alice",
            "task: delete a contact named Alice.",
            null
        ],
        "8fcf44ade1880e68dc7af01f764ae99507e0fc4966a991ed70e79814a74b6a08": [
            null,
            "task: add Bob as a favorite contact.",
            "task: send an email to Bob",
            "task: call contact Bob",
            "task: send an SMS to Bob.",
            null,
            "task: call Bob on his mobile number 222222.",
            "task: email Bob at bob@mails.com",
            "task: view or manage the contacts stored in the phone storage.",
            "task: edit the contact information for Bob.",
            "task: share contact information for Bob.",
            "task: delete a contact named Bob from the user's contacts list.",
            null,
            null
        ],
        "6063090f9aeda054081d0a358367aef074b4dfa81b5302e57e4856653362fae8": [
            null,
            "task: add Jack as a favorite contact.",
            "task: send an email to Jack.",
            "task: call the contact Jack",
            "task: send an SMS to Jack.",
            null,
            "task: call/contact Jack at the mobile number 333333.",
            "task: call or message Jack",
            "task: edit the contact information for Jack.",
            "task: edit contact information for Jack.",
            "task: share contact information for Jack.",
            "task: delete the contact named Jack.",
            null,
            null
        ],
        "bd98a979a8e6635be1fc598aef8736fbe62fa64affa9ffacfb32a7189e3f9805": [
            null,
            "Task: Add a phone number to contacts and then dial the number.",
            null,
            null,
            null,
            null,
            "Task: Dial a phone number starting with the number \"1\" and potentially add it to contacts or make a call.",
            "Task: Dial a phone number starting with the digit \"2\" and add the number to contacts for future reference.",
            "Task: Dial a phone number with the digits \"3\" and the corresponding letters \"DEF\".",
            "Task: Dial a phone number with the digit \"4\" and add it to the contact list, then call the number.",
            "Task: Dial a phone number with the digit \"5\" and the corresponding letters \"JKL\".",
            "Task: Dial a phone number with the digit \"6\" and add it to the contact list, possibly with the intention to call the number later.",
            "Task: Dial a phone number starting with the number 7 and potentially add the number to contacts or make a call.",
            "Task: Dial a phone number starting with the digit \"8\" and potentially add the number to contacts or make a call.",
            "Task: Dial a phone number with the digit \"9\" and the corresponding letters \"WXYZ\".",
            "Task: Dial a phone number that includes an asterisk (*) and potentially add the number to contacts for future use.",
            "task: dial a phone number starting with zero and add the number to contacts.",
            "Task: Dial a phone number containing a hashtag and add the number to contacts.",
            "Task: Make a phone call to a specific number from the dialer interface.",
            null
        ],
        "52a5299065b902fc4c15bdb017cc11e6f7016b4f196812630def508dd44cf179": [
            null,
            null,
            null,
            null,
            null,
            null,
            "task: view favorite contacts",
            null,
            null,
            null
        ],
        "c2f57686134356b605c0382b1627b8cb89c71e3597fe2bddae95f0f9c5a3c4e3": [
            null,
            null,
            "task: clear call history",
            null,
            "task: view the call history and details of a specific call made by Alice at 11:26 AM for 8 minutes.",
            "task: view call history with Bob on June 30th for a duration of 2 minutes.",
            "task: view the call history for Alice on June 30th.",
            null,
            "task: view call history and contacts",
            null,
            null,
            null
        ],
        "97c26a5e72123f9600f56067580508f47038bc5f2f80df18adac5f6173536cf4": [
            null,
            "task: clear the call history and confirm the deletion of selected items.",
            "task: clear the call history",
            null
        ]
    },
    "contacts": {
        "f89cc7584a3df5e0784713cb5191c2ef1607011f608b524d4625a88fb579f04b": [
            null,
            "task: sort contacts by a specific criteria (e.g., name, date added, etc.)",
            "task: filter contacts based on specific criteria such as name, phone number, or email address.",
            "task: search for a specific contact and perform actions such as sorting, filtering, creating, or navigating.",
            "task: view or edit contact information for Alice.",
            "task: view/edit contact details for Bob",
            "task: view or edit contact details for Jack",
            "task: search for a contact starting with the letter \"A\" and then sort the results by name.",
            "task: create a new contact.",
            "task: make a phone call to a specific contact by manually entering their phone number.",
            null,
            "task: add a contact to favorites.",
            "task: create a new contact group.",
            null
        ],
        "a967b4b00c494385f6b35449b1575c183f258ab736c946a12a3697c9c1f82ec0": [
            null,
            "task: manage contact groups, access settings and additional options",
            "task: view information about a specific group in the contacts.",
            null,
            null,
            "task: create a new group in the contacts.",
            "task: create a new group in the contacts app.",
            null,
            "task: create a new group and add contacts to it.",
            null,
            null,
            null
        ],
        "7e3352e3b885ef4bbfde43426dbdda6e6b967889e5eba218e0277b36d16d4cfd": [
            null,
            null,
            "Task: Create a new group in contacts and then cancel the creation process.",
            "Task: Create a new group in contacts with a specific title and save it.",
            null
        ],
        "dbb320bd2730d31325f2b7e2ee763e7ed0c43004935c35f4bd50d84e5952fde7": [
            null,
            null,
            null,
            null,
            null,
            "task: add a contact to favorites.",
            "task: add a contact to favorites.",
            null,
            "task: add a contact to favorites.",
            null,
            null,
            null
        ],
        "2eee36feaf49883f4089091008f95ae95271406fec37cb90f330f9e766bc3595": [
            null,
            null,
            null,
            null,
            "Task: Add a contact to favorites.",
            "Task: Add a contact to favorites.",
            null
        ],
        "519dcdd3d48aae92a24073b13b3e0d2704cfa3f644d023807b499013745623a0": [
            "task: import contacts from a .vcf file",
            "task: export contacts to a .vcf file",
            "task: access settings and about information",
            "task: access the about information of the contacts app.",
            null
        ],
        "6c15d08aec3a402a628f85b3d96898a6db9ec6b7d2e522ba14ac3fe2c8365d0f": [
            "task: import large contacts from a .vcf file.",
            "task: Import contacts from a .vcf file for the current week.",
            null,
            "task: Import contacts from a .vcf file stored in the Drive app.",
            "task: Import contacts from a .vcf file using the File Manager.",
            null,
            "task: import contacts from a .vcf file and view them in grid view.",
            "task: import contacts from a .vcf file and view the root directory.",
            null,
            "task: import contacts from a .vcf file and search for specific contacts.",
            null,
            null,
            null
        ],
        "8de486e14e68354b64c857f1099d349fc20b5d40f93ee564c303f524b4a80076": [
            null,
            null,
            null,
            "task: export contacts to a .vcf file and exclude phone storage from the export.",
            "Task: Export contacts to a .vcf file and then cancel the action.",
            "Task: Export contacts to a .vcf file with selected options and confirm the action.",
            null
        ],
        "8b528df166c868ad9622db32da094e4f8ffa12ba1f3b3ccc8bd32315b24eeb06": [
            null,
            null,
            "Task: Customize the colors of the contacts app interface.",
            null,
            "Task: Adjust the font size to \"Large\" in the settings of the contacts app.",
            "Task: Customize the contact fields and settings for the contacts app.",
            "Task: Disable the option to merge duplicate contacts in the settings of the contacts app.",
            "Task: Enable call confirmation dialog before initiating a call in the contacts app.",
            "Task: Hide private contacts from being displayed in Simple Dialer and Simple SMS apps.",
            null,
            "Task: Customize the appearance and layout of the contacts app's main screen and contact fields.",
            "Task: Customize the settings for the contacts app to set the main screen option to open the last used tab at app start.",
            null,
            "Task: Customize the settings for the contacts app, such as changing the color, font size, contact fields, and main screen options.",
            "Task: Disable the dialpad button on the main screen of the contacts app.",
            "Task: Customize settings to display only contacts with phone numbers in the contacts app.",
            null,
            "Task: Customize the settings for the contacts app by disabling the display of contact thumbnails.",
            "Task: Customize the settings for the contacts app to show phone numbers in the main screen options.",
            "Task: Change the contact display format to start names with surnames."
        ],
        "20b76127089899a84db48c80e26e6cfccc55dbad4cb655ec12d1a37300c1ffc9": [
            "task: import contacts from a .vcf file",
            "task: export contacts to a .vcf file",
            null
        ],
        "06d12a81a984d165f6107d52300085d901815170a2c6546fc7129a5ff30b88da": [
            null,
            "task: change the app interface to a dark theme and customize the colors.",
            "task: change the text color of the app interface.",
            "task: change the background color of the app interface.",
            "Task: Change the primary color of the app interface.",
            "task: change the app icon color",
            null
        ],
        "db8da4c4aed69c1ee76c3c58386edc9a9b8924ab9d096893dc87ae36659c73bb": [
            null,
            "task: change the theme of the app to dark mode.",
            null
        ],
        "ee4bc85165d8e30eb0e6662bbd800d46bbbc7663b2262c79288c29040a6fb67d": [
            "Task: Customize the app interface to use a dark theme and disable the auto light/dark mode feature.",
            "Task: Customize the app interface by setting the theme to Dark and unchecking the Light option.",
            "Task: Change the app interface theme to light mode.",
            "Task: Customize the app interface by setting the theme to Dark and selecting the color Dark red.",
            "Task: Change the app interface theme to dark mode and uncheck the option for the white theme.",
            "Task: Change the app interface theme to a dark theme with black and white colors.",
            "Task: Customize the colors and theme of the app interface to the dark theme.",
            null
        ],
        "0c705b9a74f692e6c4feab6b9d9f9b1b992876e5272ee28d4c03a00597b4ae41": [
            "task: change the font size of contacts to large and uncheck the small font size option.",
            "task: change the font size of the contact display to large and set the checkbox for medium size to unchecked.",
            "task: change the font size of the contact display to small.",
            "task: increase the font size for contact display on the smartphone.",
            null
        ],
        "b5c29ed0558462bb184cac18e589a6420d6aad11aaf9eab71ca82351e0d5f409": [
            "Task: Customize the display of contact information by adding a prefix to the contacts' names.",
            "Task: Customize the display of contact information by hiding the first name field.",
            "Task: Customize the display of contact information by adding the middle name field.",
            "Task: Customize the display of contact information by removing the surname field.",
            "Task: Customize the display of contact information by adding a suffix to the contact fields.",
            "Task: Customize the display of contact information by adding a nickname to a contact.",
            "Task: Customize the display of contact information by removing phone numbers from the shown contact fields.",
            "Task: Customize the display of contact information by removing the display of emails.",
            "Task: Customize the display of contact information by removing the \"Addresses\" field.",
            "Task: Customize the display of contact information by enabling instant messaging for certain contacts.",
            "Task: Customize the display of contact information by removing events (birthdays, anniversaries).",
            "Task: Customize the display of contact information by removing the \"Notes\" field.",
            "Task: Customize the ringtone for a specific contact in the smartphone's settings.",
            "Task: Customize the display of contact information and save changes.",
            "Task: Customize the display of contact information by managing shown contact fields.",
            null,
            "Task: Customize the display of contact information by adding the \"Organization\" field to the shown contact fields.",
            "Task: Customize the display of contact information by adding websites to the shown contact fields.",
            "Task: Customize the display of contact information by removing the \"Groups\" field.",
            "Task: Customize the display of contact information by removing the \"Contact source\" field."
        ],
        "9ee6d8231ca24f0fe019456840d8efebcd70fe045776f8a0890fe1740b484c4d": [
            "task: Hide contacts from being displayed in the contacts tab.",
            "task: remove the \"Favorites\" tab from the contacts homepage.",
            "task: hide or remove the \"Groups\" tab from the contacts interface.",
            "task: customize the tabs shown in the contacts interface.",
            "task: customize the tabs shown on the homepage of contacts.",
            null
        ],
        "adf218f6ae1a884d943df51a00fa0627d0ae8788c75943e49ead925144ee7ab6": [
            "Task: Set the last used app to open at app start and enable the option for contacts to be managed.",
            "task: Set the last used app to open at app start and enable the Favorites tab.",
            "Task: Set the last used app to open at app start and enable the display of groups in the contacts interface.",
            "task: Change the default app that opens at startup to the last used one.",
            null
        ],
        "e090cef73bf5816d395a110d051a4fb41fd33b544420b26b636f51b8da08f2e5": [
            "task: view contact details and call a contact.",
            "task: disable the option to view contact details when clicking on a contact.",
            "task: edit the contact details of a specific contact.",
            null
        ],
        "ccc9d9093adc8eee90eaa7f9081089d8c62c45aed859c6d1e3074fcb25a24071": [
            "Task: Add a new contact and change the photo for the newly created contact.",
            "Task: Create a new contact and mark it as a favorite.",
            null,
            null,
            null,
            "Task: Create a new contact with mobile details.",
            null,
            "Task: Create a new contact and return to the homepage.",
            null,
            "Task: Create a new contact with unknown information.",
            "Task: Add a new contact with birthday information.",
            "Task: Create a new contact and save the contact information.",
            null,
            null,
            null,
            "Task: Create a new contact and assign it to a group.",
            "Task: Create a new contact and save it to the phone's storage."
        ],
        "b497131bb37d355259223709b95c716efd4d28b0b2c5b00787c7eef44d8e896e": [
            "task: create a new contact with the contact type \"Mobile\" and then remove the \"Mobile\" contact type.",
            "task: create a new mobile contact for the home category.",
            "task: create a new contact with the type \"Mobile\" and the label \"Work\".",
            "task: create a new contact with the contact type \"Mobile\" and add it to the \"Main\" category.",
            "task: create a new contact with mobile number and add a work fax number.",
            "task: create a new contact with mobile number and check the \"Home Fax\" contact type.",
            "Task: Add a new contact with a mobile number and an unchecked pager option.",
            "task: create a new contact with the contact type \"Mobile\" and select \"Other\" as an additional contact type.",
            "task: create a new custom contact with the contact type set as mobile.",
            null
        ],
        "bcc5460a524636adcd43bafd581c027dc236295050dd625e2ed4b0b742d543ac": [
            "task: create a new contact and set the contact type as Home.",
            "task: create a new contact and select the contact type as \"Work\".",
            "task: create a new contact and select the contact type as \"Mobile\".",
            "task: create a new contact and select the contact type as \"Other\".",
            "task: create a new contact with a custom contact type.",
            null
        ],
        "22722d2dee1335c5482c1049aa7a6dbd5e481466f1ef8b3fa3a91a34b24b329d": [
            "task: create a new contact with the name \"Unknown\" and set the date of birth to 2023.",
            "task: create a new contact with an unknown name and set the date as Saturday, July 1.",
            "task: create a new contact with the name \"Unknown\" and set the birthdate as 01 July 2023.",
            "task: create a new contact with a birthday on 02 July 2023.",
            "task: create a new contact on July 3, 2023.",
            "task: create a new contact with a birthday on July 4, 2023.",
            "task: create a new contact with the name \"Unknown\" and set the birthdate as July 5, 2023.",
            "task: create a new contact with a birthdate of July 6, 2023.",
            "Task: Create a new contact with the name \"Unknown\" and set the birthdate as July 7, 2023.",
            "Task: Create a new contact with the name \"Unknown\" and set the date of birth as 08 July 2023.",
            "Task: Create a new contact with the name \"Unknown\" and set the birthdate as July 9, 2023.",
            "task: create a new contact with the name \"Unknown\" and set the birthdate as July 10, 2023.",
            "Task: Create a new contact with the name \"Unknown\" and set the birthdate as July 11, 2023.",
            "task: create a new contact with the name \"Unknown\" and set the birthdate as July 12, 2023.",
            "Task: Create a new contact with the name \"Unknown\" and set the birthdate as July 13, 2023.",
            "task: create a new contact with the name \"Unknown\" and set the birthdate as July 14, 2023.",
            "task: create a new contact with a birthday on July 15, 2023.",
            "task: create a new contact with the name \"Unknown\" and set the birthdate as July 16, 2023.",
            "task: create a new contact with the name \"Unknown\" and set the birthdate as July 17, 2023.",
            "task: create a new contact with a birthday on July 18, 2023.",
            "task: create a new contact with the name \"Unknown\" and set the birthdate as July 19, 2023.",
            "task: create a new contact with the name \"Unknown\" and set the date of birth as 20 July 2023.",
            "task: create a new contact with a birthday on July 21, 2023.",
            "Task: Create a new contact with the name \"Unknown\" and set the date of birth as 22 July 2023.",
            "Task: Create a new contact with the name \"Unknown\" and set the birthdate as July 23, 2023.",
            "Task: Create a new contact with the name \"Unknown\" and set the date of birth as 24th July 2023.",
            "Task: Create a new contact with the name \"Unknown\" and set the birthdate as July 25, 2023.",
            "Task: Create a new contact with the name \"Unknown\" and set the birthdate as July 26, 2023.",
            "Task: Create a new contact with the name \"Unknown\" and set the birthdate as July 27, 2023.",
            "task: create a new contact with a birthday on July 28, 2023.",
            "task: create a new contact with the name \"Unknown\" and set the birthdate as July 29, 2023.",
            "task: create a new contact with the name \"Unknown\" and set the birthdate as July 30, 2023.",
            "task: create a new contact with a birthday on July 31, 2023.",
            "task: create a new contact and navigate to the previous month in the calendar.",
            "task: create a new contact and navigate to the calendar to schedule a meeting or event for next month.",
            "task: create a new contact and hide the year in the calendar.",
            "task: create a new contact and then cancel the operation.",
            "task: create a new contact with unknown details and confirm the creation.",
            null
        ],
        "1d44133c96356351315b0e4a555dec2dde8933d6120a3e2dd793c7d97a7f814b": [
            "task: create a new contact with a birthday and an unchecked anniversary.",
            "Task: Create a new contact and remove the \"Birthday\" category from the contact's details.",
            "task: create a new contact with a birthday and categorize it as \"Other\".",
            null
        ],
        "0ca12ca4f59bd6e046754ae02e4ab0247b43b7af73a1d6d6f2d25684436f347c": [
            "Task: Add a new contact and change the photo by taking a new picture.",
            "task: create a new contact and change the photo by selecting a photo from the camera/gallery.",
            null
        ],
        "4a494442ef7fe79bad63d60f6260344632e313aeebf760de959e5860f9d4efb6": [
            "task: Create a new contact and change the photo by taking a new one.",
            "task: create a new contact and change the photo by taking a new one.",
            null
        ],
        "dbe4c78447ae062515b18647ed79838215a4ed7fe3576b535a639d5e5dbe0042": [
            "task: create a new contact and change the photo by taking a picture and retaking it if necessary.",
            "task: create a new contact and change the photo by taking a new picture and saving it.",
            "task: create a new contact and change the photo by taking a new picture, but cancel the operation.",
            null
        ],
        "f7b661f3f3a53b2d4831a6229a279f617dab5482fb9739aef48663e87371ebfe": [
            null,
            "task: Change the photo of a contact by taking a new photo using the smartphone's camera and editing it in the gallery's basic editor.",
            "task: take a photo and set it as the profile picture for a new contact.",
            "task: Change the photo of a contact by taking a new photo and setting it as the contact's profile picture.",
            "task: change the photo of a contact and save it.",
            null
        ],
        "aa42d6d7b1951400500e8c45aa29d226bcb19ef5818ba59d3557c3199a3c4c1f": [
            "task: create a new group for managing contacts and groups.",
            "task: create a new contact without assigning it to any groups and then cancel the operation.",
            "task: create a new contact and add it to the default group.",
            null
        ],
        "71ad59c500ac9c66a089da0d2c9694928a6d73f57a5b16001b88eedd88f87a68": [
            "task: create a new contact and change privacy settings for phone storage.",
            null
        ],
        "c4f2f694d4393ad28929563eab36ffcb82111106f8d4dd5e224b6efd8e344bfe": [
            "Task: Customize the fields displayed for a new contact.",
            null
        ],
        "e131e93f5e9876af5d1d17d63a70b5a135f1dfc93972683f1af1eef3a7388748": [
            null,
            "task: toggle favorite status for contact Alice.",
            "task: send an email to Alice.",
            "task: call contact Alice",
            "task: send an SMS to Alice.",
            null,
            "task: call Alice on her mobile number 111111.",
            "task: send an email to Alice at alice@mails.com.",
            "task: change the photo of the contact named Alice",
            "task: edit contact information for Alice.",
            "task: share Alice's contact information with someone.",
            "task: delete contact Alice",
            null,
            null
        ],
        "03b40b6d114743d46681fa77f4a0a480dae509a2bfea2318de6a1cd4e78d586f": [
            "task: change the photo of the contact named Alice.",
            null,
            null,
            null,
            null,
            "task: edit the mobile number for the contact named Alice.",
            null,
            "task: edit contact information for Alice",
            null,
            "task: edit the contact named Alice.",
            "task: edit Alice's birthday in the contact information.",
            "task: edit and save contact information for Alice.",
            null,
            null,
            null,
            null,
            null,
            "task: edit contact Alice and remove her from any groups.",
            null
        ],
        "467d921c37c70b9fd0d0f21ea8b93c3025ef4d0984d7aab6e67e6c940756c3e0": [
            "task: make a phone call to Alice with the microphone turned off.",
            "task: make a phone call to Alice and turn off the speaker.",
            "task: make a phone call to Alice using the dialpad.",
            "task: put Alice on hold during a phone call.",
            "task: add a call to Alice",
            "task: make a phone call to Alice and end the call.",
            null,
            null,
            null,
            null
        ],
        "bfab4bf7c2c7b54f18f22d052fbdf2b69462dabb826993d560228c72a672c27b": [
            null,
            "task: confirm deletion of contact Alice.",
            "task: delete the contact named Alice.",
            null
        ],
        "8fcf44ade1880e68dc7af01f764ae99507e0fc4966a991ed70e79814a74b6a08": [
            null,
            "task: mark Bob as a favorite contact.",
            "task: send an email to the contact named Bob.",
            "task: call the contact named Bob.",
            "task: send an SMS to Bob",
            null,
            "task: call Bob on his mobile number 222222.",
            "task: send an email to Bob at bob@mails.com.",
            "task: view the phone storage usage of the contact Bob.",
            "task: edit the contact information of Bob.",
            "task: share Bob's contact information with someone.",
            "task: delete the contact named Bob from the user's contacts list.",
            null,
            null
        ],
        "52e178c921ff9d93ab5665339017cf1d2b508ebfca1a68aff58ac3cb4d7c5db2": [
            "Task: Change the photo of the contact named Bob.",
            null,
            null,
            null,
            null,
            "task: edit the mobile number for contact Bob.",
            null,
            "task: edit the contact information for Bob.",
            null,
            "task: edit the contact information for the contact named Unknown.",
            "task: edit the birthday information of contact Bob.",
            "task: edit and save the contact information for Bob.",
            null,
            null,
            null,
            null,
            null,
            "task: edit contact Bob and assign them to a group.",
            null
        ],
        "33261b024cf187d44cfbd77ea3cc0b387c9dc6a7ca8739e8c64c9449cb33976d": [
            "task: make a phone call to Bob with the microphone turned off.",
            "task: make a phone call to Bob and turn off the speaker.",
            "task: make a phone call to contact Bob using the dialpad.",
            "task: put a call with Bob on hold.",
            "task: add a call to the contact Bob.",
            "task: make a phone call to contact Bob and end the call.",
            null,
            null,
            null,
            null
        ],
        "1cae07095b38daec40a4d1a5bc88a2cae60b174bae11023984db189c7506503a": [
            null,
            null,
            null,
            null,
            null
        ],
        "e33d889be8cc45d985cf46d1e1f3a3f3be9e098aebbea7c73e49dd1cdc6c5cb1": [
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null
        ],
        "0c6ecc168d278b6c47b1eed30c10b455056e5e0d4664c844fde18c4555c3aa90": [
            "Task: Create a new contact group and add Bob to the group.",
            "Task: Create a new contact group for Bob.",
            "task: create a new contact group for Bob.",
            "task: create a new contact group for Bob.",
            null
        ],
        "6063090f9aeda054081d0a358367aef074b4dfa81b5302e57e4856653362fae8": [
            null,
            "task: toggle favorite status for contact Jack.",
            "task: send an email to Jack",
            "task: call contact Jack",
            "task: send an SMS to contact Jack.",
            null,
            "task: call Jack on his mobile phone.",
            "task: send an email to Jack at jack@mails.com.",
            "task: change the photo of contact Jack.",
            "task: edit contact information for Jack",
            "task: share contact information of Jack with someone.",
            "task: delete the contact Jack.",
            null,
            null
        ],
        "bd98a979a8e6635be1fc598aef8736fbe62fa64affa9ffacfb32a7189e3f9805": [
            null,
            "task: add a new number to an existing contact.",
            null,
            null,
            null,
            null,
            "Task: Dial a phone number starting with the digit \"1\".",
            "task: make a phone call to a contact whose name starts with the letter 'B'.",
            "task: make a phone call to a contact whose name starts with the letter 'D' or 'E' or 'F'.",
            "task: dial a phone number containing the digit 4 and the letters G, H, and I.",
            "task: dial a phone number containing the digit 5 and the letters J, K, and L.",
            "task: make a phone call to a contact whose name starts with the letter 'M'.",
            "task: make a phone call to a contact whose name or number contains the digit 7.",
            "task: dial a phone number containing the digit 8.",
            "task: dial a phone number containing the digit 9 and the letters W, X, Y, or Z.",
            "task: make a phone call using the dialpad and include the asterisk symbol in the number.",
            "task: dial a phone number starting with zero and add it to the current call.",
            "task: make a phone call to a contact or number starting with the hashtag symbol.",
            "task: make a phone call to a specific number",
            null
        ]
    },
    "clock": {
        "fb78df2efd2d0dae6fe2d27fc76d3c48cf2944110abca15ccb49178d2e962f30": [
            "task: explore more apps from the developer.",
            "task: adjust clock, alarm, stopwatch, timer, or app settings.",
            "task: Access information about the clock app and its various features and settings.",
            "task: set an alarm for 5:00 AM.",
            "task: create a new timer",
            "task: Set an alarm for a specific time.",
            "task: set or manage an alarm on the smartphone.",
            "Task: Start or use the stopwatch feature on the clock app.",
            null,
            null
        ],
        "c6da5bca26734434e32e38c9887040ed4b3cd739dcc3901924cf5435d5889de3": [
            null,
            null,
            "Task: Customize clock colors and possibly purchase additional features.",
            "task: customize the colors of the clock widget",
            null,
            "task: customize clock colors and purchase additional features",
            "task: adjust the phone's sleep settings for the clock app.",
            "task: change the start day of the week for the clock.",
            null,
            "task: customize the maximum reminder duration for the clock.",
            "task: customize the clock colors and disable the gradual increase in volume feature.",
            "task: customize snooze time for alarms in the clock app.",
            null,
            "task: customize the maximum reminder duration for the clock.",
            "task: adjust the snooze time for the alarm on the clock app.",
            null
        ],
        "108039bf498ec6f740c32cae29e400b56a62c9be94fb8a0c87da58f54e61ca18": [
            "task: adjust the maximum reminder duration for alarms to 5 minutes and enable a 1-minute reminder option.",
            "task: change the maximum reminder duration for alarms to a value other than 5 minutes.",
            "task: set the maximum reminder duration for the alarm to 10 minutes.",
            "task: adjust the maximum reminder duration for alarms to 30 minutes.",
            "task: set the maximum reminder duration for alarms to 1 hour.",
            "task: set the maximum reminder duration for alarms to 5 minutes with a custom option.",
            "task: set the maximum reminder duration for the alarm to 5 minutes.",
            null
        ],
        "2563cd0132df7babcf5f9118008656bfd16c87e3d799ad0d679adbe9d56e76d1": [
            "task: adjust the snooze time for the alarm to 10 minutes and enable a 1-minute snooze option.",
            "task: adjust the snooze time for the alarm to either 10 minutes or 5 minutes.",
            "task: adjust the snooze time for the alarm to 10 minutes.",
            "task: adjust snooze time for the alarm to either 10 minutes or 30 minutes.",
            "task: adjust the snooze time for the alarm to 1 hour.",
            "task: adjust the snooze time for the alarm to 10 minutes and enable the custom option for setting the alarm duration.",
            "task: adjust the snooze time for the alarm to 10 minutes.",
            null
        ],
        "88b83f316a333199154fb1ad50c83943aea478deaf68b4f778cbfd3e257f7713": [
            "task: change the maximum reminder duration for alarms to a custom time.",
            "task: set the maximum reminder duration for the clock app to either 1 minute or 5 minutes.",
            "task: set the maximum reminder duration for the alarm to 10 minutes.",
            "task: Set the maximum reminder duration for the clock app to 30 minutes.",
            "task: set the maximum reminder duration for alarms to 1 hour.",
            "task: Set the maximum reminder duration for the clock app to 1 minute with a custom option.",
            "task: Set the maximum reminder duration for the alarm to 1 minute.",
            null
        ],
        "e8d6ea2d2c622928441bd48f7d265f64d14c26665a18fdd92d2535e87abe4062": [
            null,
            "task: create a new timer with the option to enable vibration.",
            "task: create a new timer with default settings (Cesium style)",
            null,
            "task: create a new timer and then cancel it",
            "task: create a new timer and set the alarm time, choose vibration, select clock style, add label, and confirm or cancel the settings.",
            null
        ],
        "b2ddbbfba7219a3fc8de3343b42be3211aa9902802bbb7b8c1f0149e06210499": [
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            "task: set a timer for a specific duration.",
            null
        ],
        "0fe4d8ae84dc5fed6fb0db2cfae8801722cc0594525a17b91585a9bb6658f07d": [
            "task: sort the alarms in the clock app.",
            null,
            null,
            null,
            "task: Set a recurring alarm for 7:00 am on Monday, Tuesday, Wednesday, Thursday, and Friday.",
            "task: Set an alarm for 9:00 am on Sunday and Saturday.",
            null,
            null,
            null,
            "task: Set a timer on the smartphone.",
            null
        ],
        "9d99b0a713bd7cc17a913f7a8127df984fec4d4a9a8e7676f4891f144b126986": [
            null,
            "task: Set an alarm for 7:00 am on Monday, Tuesday, Wednesday, Thursday, and Friday, with the alarm set to vibrate and a specific clock style.",
            "task: Set an alarm for 7:00 am on Monday and choose the \"M\" clock style.",
            "task: Set an alarm for 7:00 am on Monday, Tuesday, Wednesday, Thursday, and Friday, with the alarm set to vibrate and the clock style set to \"T\".",
            "task: Set an alarm for 7:00 am on Monday, Tuesday, Wednesday, Thursday, and Friday with the vibrate option enabled and a specific clock style selected.",
            "Task: Set an alarm for 7:00 am on Monday, Tuesday, Wednesday, Thursday, and Friday with the vibrate option enabled and a specific clock style.",
            "task: Set a recurring alarm for 7:00 am on weekdays with the phone set to vibrate.",
            "task: Set an alarm for 7:00 am on Monday, Tuesday, Wednesday, Thursday, and Friday, with vibration enabled and a specific clock style.",
            "task: set an alarm for 7:00 am on Monday, Tuesday, Wednesday, Thursday, and Friday, with vibrate disabled.",
            "task: Set an alarm for 7:00 am on Monday, Tuesday, Wednesday, Thursday, and Friday with the default clock style (Cesium).",
            null,
            "task: Set an alarm for 7:00 am on Monday, Tuesday, Wednesday, Thursday, and Friday, and then cancel it.",
            "task: set a recurring alarm for 7:00 am on weekdays.",
            null
        ],
        "c4814a6207d0182dff9710e56ac693646b3324b789ee67584d011088e91cd1c4": [
            null,
            "task: create a new timer with a default sound and the option to add a new sound.",
            null,
            "task: create a new timer with default settings and disable the sound for the alarm.",
            "task: create a new timer, select the default clock sound, and uncheck the Argon sound option.",
            "task: create a new timer with the default sound and uncheck the \"Barium\" sound option.",
            "task: create a new timer with the default sound and enable the BeeBeep Alarm.",
            "task: create a new timer with the default sound and disable the Beep-Beep-Beep Alarm sound.",
            "task: create a new timer with a default sound and enable the buzzer alarm.",
            "task: create a new timer, select the default clock sound, and uncheck the Carbon sound option.",
            "task: create a new timer and select the default clock sound",
            "task: create a new timer, select the default clock sound (Cesium), and uncheck the Fermium sound option.",
            "task: create a new timer, select the default sound (Cesium), and uncheck the Hassium sound for the alarm.",
            null,
            null,
            null,
            "task: create a new timer with the default sound and uncheck the \"Helium\" sound option.",
            "task: create a new timer, select the default sound (Cesium), and uncheck the Krypton sound for the alarm.",
            "task: create a new timer with the default sound option and disable the Neon sound option.",
            "task: create a new timer, select the default sound (Cesium), and uncheck the Neptunium sound for the alarm.",
            "task: create a new timer, select the default clock sound, and uncheck the Nobelium clock sound.",
            "task: create a new timer, select the default sound (Cesium), and uncheck the Osmium sound for the alarm.",
            "task: create a new timer, select the default sound (Cesium), and uncheck the Oxygen sound for the alarm.",
            "task: create a new timer with a default sound and enable the Piezo Alarm.",
            "task: create a new timer, select the default clock sound, and uncheck the Platinum sound option.",
            "task: create a new timer, select the default sound (Cesium), and enable/disable the sound option for Plutonium.",
            "task: Set a new timer with the default sound and enable the Rooster Alarm option.",
            "task: create a new timer, select the default sound (Cesium), and uncheck the Scandium sound for the alarm."
        ],
        "f909564be197db0f7e5de120ffc5bdecd6a0dec748e1305ad874d86cb3a6dcb4": [
            "task: set an alarm for 9:00 am on Sundays and Saturdays.",
            "task: Set an alarm for 9:00 am on Sundays and Saturdays with the label \"S\" and choose the vibrate option.",
            "task: Set an alarm for 9:00 am on Sunday and Saturday, with the label \"M\" and vibrate option enabled.",
            "task: set an alarm for 9:00 am on Sunday and Saturday, with the label \"T\" and vibrate option selected.",
            "task: set an alarm for 9:00 am on Sundays and Saturdays, with the label \"W\" and vibrate option enabled.",
            "task: set an alarm for 9:00 am on Sundays and Saturdays, with the label \"T\" and vibrate enabled.",
            "task: Set an alarm for 9:00 am on Sundays and Saturdays with the label \"F\" and choose to vibrate.",
            "Task: Set an alarm for 9:00 am on Sunday and Saturday with the label \"S\" and vibrate mode enabled.",
            "task: set an alarm for 9:00 am on Sundays and Saturdays with the option to vibrate.",
            "task: Set an alarm for 9:00 am on Sundays and Saturdays with the default alarm sound and vibration settings.",
            null,
            "task: cancel setting an alarm for 9:00 am on Sunday and Saturday.",
            "task: set an alarm for 9:00 am on Sundays and Saturdays.",
            null
        ],
        "b21791a8bb89972e81e8b9d3e4ddf93de440716d1c87b9d042f40d346f48079c": [
            null,
            null,
            null,
            "task: start the stopwatch and set it to 0.0.",
            null,
            null,
            null,
            "task: set a stopwatch or set a timer.",
            null
        ],
        "f4f8a01c4da0c6a7814b8b426e7de3e913be221bbc8d3de95e0ccc2be9af9e48": [
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null
        ]
    },
    "gallery": {
        "a54edb4560e79ad038ec5120a09ec838b034edd416abba65385969613b18a95b": [
            null,
            "task: take a photo or record a video using the smartphone's camera.",
            "task: view all the content in the folders of the gallery.",
            "task: access additional options and manage smartphone apps",
            "task: access the internal storage of the smartphone and manage apps, camera, folders, and additional options.",
            "task: View and manage photos in the DCIM folder on the smartphone.",
            null
        ],
        "1fe2495c877d5fb97b300a4b11940855c97f6c7ec5c0ec6e0305af52b0887714": [
            null,
            "task: take a photo or record a video using the camera app.",
            "task: take a photo or record a video using the camera app.",
            "task: Take a photo or record a video using the camera app.",
            null
        ],
        "f27215cd13aecb6d203d7bed4c753284d24de06edc57717b9b126076303b5fdc": [
            "task: sort the gallery by a specific criteria",
            "task: filter media in the smartphone app gallery.",
            "task: change the view type of the gallery in the smartphone app.",
            "task: temporarily show hidden photos in the smartphone app gallery.",
            "task: temporarily show excluded photos in the smartphone app gallery.",
            "task: create a new folder in the smartphone app gallery.",
            "task: change the column count for the gallery view in the smartphone app.",
            "task: access the settings and information of the smartphone app gallery.",
            "task: access information about the gallery app",
            null
        ],
        "bcdc8bc32ab330c072627acc28b712faa15abff6c965ca31c5db8d7ec7f3ccd3": [
            null,
            "task: Sort the gallery of smartphone apps by name in ascending order.",
            "task: Sort and filter gallery images by path.",
            "task: Sort and filter smartphone apps by size in ascending or descending order.",
            "task: Sort gallery images by criteria other than last modified date.",
            "task: Sort the gallery photos by date taken in ascending or descending order.",
            "task: Sort the gallery of smartphone apps by random order.",
            "task: Sort and filter smartphone apps based on custom criteria and preferences.",
            "task: Sort the gallery images in ascending order based on various criteria and preferences.",
            "task: Sort the gallery in ascending order based on a specific criteria or preference.",
            "task: Sort and filter smartphone apps based on various criteria and preferences.",
            "task: Sort and filter smartphone apps based on various criteria and preferences.",
            null
        ],
        "f296892e0ae3270e7e5851ec7aa50dd071de98f2905930ac1676391c0f1f64dd": [
            null,
            "task: filter and select media files for display or export",
            "task: filter and select media files for display or export, excluding videos.",
            "task: filter and select media files for display or export, excluding GIFs.",
            "task: filter and select media files for display or export, excluding RAW images.",
            "task: filter and select media files for display or export, excluding SVGs.",
            "task: filter and select portraits in the gallery for display or export.",
            "task: filter and select media files for display or export.",
            "task: filter and select media files for display or export",
            null
        ],
        "7dff668a1a1b95194b239f49899f5b1b85768029e3f9067123d3277b3a8b9f3b": [
            "task: Change the view type of the gallery display to a different layout.",
            "task: change the view type of the app gallery display to a list format.",
            "task: change the view type of the app gallery and group direct subfolders.",
            "task: change the view type of the app gallery display.",
            "task: change the view type of the app gallery display.",
            null
        ],
        "439da42741fa3e717568b85f7850d504c6e01288f51f6e8036e63fc0cf7da179": [
            null,
            "Task: Create a new folder in the internal storage of the gallery app.",
            "Task: Create a new folder in the gallery app and set an alarm with 0 items.",
            "task: Create a new folder in the gallery app on an Android device.",
            "Task: Create a new folder for organizing audiobooks in the gallery.",
            "task: Create a new folder in the DCIM directory and manage the files within it.",
            "task: create a new folder in the Documents section.",
            "Task: Create a new folder and download one item in the gallery.",
            "Task: Create a new folder in the gallery and move movies into it.",
            "Task: Create a new folder in the gallery to organize music files.",
            "task: Create a new folder and manage notifications in the gallery app.",
            "Task: Create a new folder and add pictures to it.",
            "task: create a new folder in the gallery.",
            "Task: Create a new folder in the gallery.",
            null,
            "Task: Create a new folder in the gallery and navigate to the Podcasts section.",
            "Task: Create a new folder in the gallery and set a ringtone for it.",
            "task: create a new folder and move the image \"screen_2023-06-30_141247.png\" into it.",
            "task: create a new folder and select an image file to add to it.",
            null
        ],
        "6919cfa097bb6dc5bcc70b3a04c75500aeb04e8db499b49ba0c033318894e3aa": [
            null,
            "task: create a new folder in the gallery and select the SD Card as the storage location for smartphone apps.",
            "task: create a new folder and select the storage location for smartphone apps.",
            null
        ],
        "f4e3bb56b18f61edcbc485302f7614a0c5ba2e590c7ce1e15e06c3272314ca1e": [
            null,
            "task: create a new folder in the gallery and select the SD card as the location for the folder.",
            null,
            "task: create a new folder in the gallery app and move files from the internal storage to the SD card.",
            null,
            "Task: Create a new folder in the internal storage of the smartphone app.",
            null,
            "task: create a new folder and download files to the internal storage or SD card.",
            "task: create a new folder in the internal storage and check if the SD card contains a folder named LOST.DIR.",
            null,
            "Task: Creating a new folder in the gallery app and selecting the internal storage to manage music files.",
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null
        ],
        "35eaf64d1ecc1be38d8ba6b606c51c8f981caee6862065502be6803f57796b58": [
            null,
            "task: create a new folder and select storage location for the folder (internal or SD card).",
            "task: create a new folder and select storage location for the folder (internal or SD card).",
            null
        ],
        "62201a86c54e8da86647b398f58a99a0615b95e99ce263caf628d12b35799c48": [
            null,
            null,
            null,
            null,
            null,
            null
        ],
        "3d2fb79219ed38df93493d5435d95ee98f91059cb992b203b17bb80fe3ee03e0": [
            "Task: Change the number of columns for the app gallery display to 1.",
            "Task: Change the number of columns for the app gallery display to one.",
            "Task: Change the number of columns for the app gallery display to 3.",
            "Task: Adjust the number of columns for the app gallery display to 4.",
            "Task: Change the number of columns for the app gallery display to 5.",
            "Task: Adjust the number of columns for the app gallery display to 6.",
            "Task: Change the number of columns for the app gallery display to 7.",
            "Task: Change the number of columns for the app gallery display to 8.",
            "Task: Adjust the number of columns for the app gallery display to 9.",
            "Task: Change the number of columns for the app gallery display to 10.",
            "Task: Adjust the number of columns for the app gallery display to 11.",
            "Task: Change the number of columns for the app gallery display to 12.",
            "Task: Change the number of columns for the app gallery display to 13.",
            "Task: Change the number of columns for the app gallery display to 14.",
            "Task: Change the number of columns for the app gallery display to 15.",
            null,
            "Task: Change the number of columns for the app gallery display to 16.",
            "Task: Change the number of columns for the app gallery display to 17.",
            "Task: Change the number of columns for the app gallery display to 18.",
            "Task: Change the number of columns for the app gallery display to 19.",
            "Task: Change the number of columns for the app gallery display to 20."
        ],
        "e7268484b7258b11ad6f5dfc4e72131530628ba054524cfd6de55d3ada46c06d": [
            null,
            null,
            "Task: Customize the colors of the gallery app.",
            null,
            "Task: Change the date and time format for managing files and media in the app's settings.",
            "Task: Adjust the file loading priority speed in the app's settings.",
            "Task: Customize the included folders for managing files and media in the gallery app.",
            "Task: Exclude specific folders from being displayed in the gallery.",
            "Task: Enable the display of hidden items in the gallery app.",
            "task: Change the search settings to include all files instead of just folders in the gallery.",
            null,
            "Task: Disable automatic video playback in the gallery app.",
            null,
            "Task: Enable or disable the option to remember the last video playback position in the gallery app.",
            "Task: Enable or disable the loop videos feature in the gallery app.",
            "task: customize app settings to always open videos on a separate screen with new h.",
            "Task: Disable the option to control video volume and brightness with external devices.",
            null,
            "Task: Disable the option to crop thumbnails into squares in the gallery app settings.",
            "Task: Change the thumbnail style for files in the gallery app.",
            "Task: Change the folder thumbnail style to square in the gallery app settings.",
            null,
            "Task: Customize the gallery app settings to enable horizontal scrolling of thumbnails.",
            "task: Disable pull-to-refresh feature in the gallery app settings.",
            null,
            "Task: Adjust the app settings to enable maximum brightness when viewing fullscreen media.",
            "Task: Enable black background for fullscreen media in the gallery app.",
            "task: Enable or disable the option to automatically hide system UI when viewing fullscreen media in the gallery app.",
            "Task: Enable or disable the option to instantly change media by clicking on the screen.",
            "Task: Adjust the settings to allow controlling photo brightness with a vertical gesture in the gallery app.",
            "task: Disable the option to close the fullscreen view with a down gesture in the gallery app.",
            "Task: Disable the display of a notch on the smartphone screen in the gallery app settings.",
            "task: adjust the system setting for rotating fullscreen media in the gallery app.",
            null,
            "Task: Disable deep zooming feature for images in the gallery app.",
            "task: disable the option to rotate images with gestures in the gallery app settings.",
            "Task: Adjust the app settings to display images in the highest possible quality.",
            "Task: Enable or disable the option for 1:1 zooming in with double taps in the gallery app settings.",
            null,
            "task: customize app settings to show extended details over fullscreen media.",
            null,
            "task: Enable password protection for the gallery app.",
            "Task: Enable password protection for hidden items in the gallery.",
            "Task: Enable password protection for file deletion and moving in the gallery app.",
            null,
            "Task: Customize app settings to enable automatic deletion of empty folders after deleting their content.",
            "task: disable the option to keep old last-modified value at file operations.",
            "Task: Customize app settings to always skip delete confirmation dialog for managing files and media in the gallery app.",
            null,
            "task: Customize app settings to hide action buttons at the bottom of the screen.",
            "task: customize the visible bottom actions in the gallery app.",
            null,
            "task: Change the settings to move items into the Recycle Bin instead of deleting them.",
            "task: Hide the Recycle Bin from the folders screen in the gallery app.",
            "task: Customize app settings to show the Recycle Bin as the last item on the main gallery page.",
            "task: Empty the Recycle Bin to permanently delete files and free up storage space.",
            null,
            "Task: Clear the cache of the gallery app to free up storage space.",
            "Task: Export favorite files or media from the gallery app.",
            "Task: Import favorites from another device or application into the gallery app.",
            "Task: Export app settings and preferences for managing files and media.",
            "Task: Import settings for managing files and media in the gallery app."
        ],
        "06d12a81a984d165f6107d52300085d901815170a2c6546fc7129a5ff30b88da": [
            null,
            "Task: Change the app's color theme to Dark.",
            "Task: Change the text color of the app's interface.",
            "Task: Change the background color of the gallery app.",
            "Task: Change the primary color of the app's theme.",
            "Task: Change the app icon color in the gallery app.",
            null
        ],
        "db8da4c4aed69c1ee76c3c58386edc9a9b8924ab9d096893dc87ae36659c73bb": [
            null,
            "task: customize the colors and theme of the gallery app to a dark theme.",
            null
        ],
        "ee4bc85165d8e30eb0e6662bbd800d46bbbc7663b2262c79288c29040a6fb67d": [
            "Task: Customize the light and dark themes for the smartphone apps and enable/disable auto light/dark mode.",
            "Task: Customize the colors and theme of the gallery app to have a dark theme with the light option unchecked.",
            "Task: Change the theme of the gallery app to the light theme.",
            "Task: Customize the color theme of the gallery app to \"Dark red\".",
            "Task: Customize the color theme of the gallery app to a dark theme and uncheck the option for the color white.",
            "Task: Customize the color theme of the smartphone apps to a dark theme with black & white colors.",
            "Task: Customize the color theme of the gallery app to a dark theme.",
            null
        ],
        "e4a794e809bcf58fa0ca0ed45cf1a92b7b212cb82db7d3a70e21a63c34749186": [
            "task: change the file loading priority speed settings for the gallery app.",
            "task: adjust file loading priority speed and enable/disable compromise for filtering and displaying apps in the gallery.",
            "task: adjust file loading priority settings to avoid displaying invalid files in the gallery.",
            null
        ],
        "a0054e64f7fd8323b726966d1b4fdb1fdd5f8a2a5f9bc0325952e490f2b3da79": [
            null,
            "task: add a new folder to the app gallery.",
            null,
            null
        ],
        "b1c3c890e54515a04e321d35af0328cdce2b22c11f5375faf000c082bdb1416f": [
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            "Task: Customize app settings to search all files instead of folders on the main screen.",
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            "Task: Clear the cache for file management and media viewing in the app's settings.",
            null,
            null,
            null,
            null,
            null
        ],
        "075474cc3814f2330ca5c0f164517189e565440073b31fd926ac36e22e3d8cc7": [
            null,
            null,
            null,
            null
        ],
        "0dfc17195a1ba68a96bc502389e3627b0981e51a59f5fcf4c6f20058633516fb": [
            "task: adjust the thumbnail spacing in the app gallery display settings.",
            "task: customize the thumbnail style of the gallery app to have rounded corners.",
            "task: customize the gallery display settings to enable animation for GIF thumbnails.",
            "task: customize the display settings of the app gallery and enable the option to show video durations.",
            "task: customize the gallery display settings to hide image file types.",
            "task: customize the file thumbnail style and disable marking favorite items in the gallery app.",
            "task: change the file thumbnail style in the app gallery display settings.",
            "task: customize the file thumbnail style in the app gallery.",
            null
        ],
        "f48966ab2fd7d96f8892f62c2b8040354b716ab44818e9b60cd5d91e9545de1e": [
            null,
            "task: Search for a specific file, toggle the visibility of the file names, and perform additional sorting or options on the gallery.",
            "task: Sort the images in the gallery by a specific criteria or preference.",
            null,
            null
        ],
        "c4867c874a83f1245254d117e2f3761349f3beeeedd4fb03c66f737ccafa242a": [
            null,
            "task: toggle the visibility of filenames in the DCIM folder in the smartphone app gallery.",
            "task: Sort the photos in the DCIM folder in the smartphone app gallery.",
            null,
            null
        ],
        "827a24e214c3d5fda9cba05c5e5bc5c9d0e6d3e81a093a080e8cc952e01740c9": [
            null,
            "task: toggle the visibility of filenames in the gallery's folder view.",
            "task: view all files in folder view",
            null,
            "task: view all files in the gallery from yesterday.",
            null
        ],
        "5671bd90bd97eca48538d0127d0ed1c838f79ec595814f95d2db8dddb827ebab": [
            null,
            null,
            null,
            null,
            null,
            "task: toggle the visibility of the filename for the image \"screen_2023-06-30_143638.png\" in the gallery.",
            "task: toggle the visibility of the filename for the image \"screen_2023-06-30_141247.png\" in the gallery.",
            "task: view the content of all folders and toggle the visibility of filenames, then open and view the image \"pic1.jpg\".",
            "task: toggle visibility of the filename for the image \"pic2.jpg\" in the gallery.",
            "task: Play video1.mp4 from the gallery.",
            "task: toggle the visibility of the filename for the video file \"video2.mp4\" in the gallery.",
            "task: toggle the visibility of the filename for the video file \"video3.mp4\" in the gallery.",
            "task: toggle the visibility of the filename for the image \"pic3.jpg\" in the gallery.",
            null
        ]
    },
    "calendar": {
        "b037bd18f22672a681a11f31d2309ba4f48e3941ff9ac63a6a164e72ee9dc5d0": [
            null,
            "task: search for a specific event or appointment in the calendar.",
            "task: change the view of the calendar",
            "task: access options and manage calendar events",
            "task: view events and manage calendar for the month of July.",
            "task: create a new event in the calendar.",
            null
        ],
        "41fab8a8229a01a4c4c0872b6e5932eaf07f8213f9a950020253a3a4f0f484b3": [
            "task: Change the calendar view to daily view.",
            "task: change the calendar view to weekly view",
            "task: switch to a different view in the calendar and navigate back to the previous screen.",
            "task: change the calendar view to yearly view.",
            "task: change the calendar view to a simple event list.",
            null
        ],
        "e77ab12715745be71108b1340969dc8973018a73602438535093fc51ab6aab28": [
            null,
            "task: search for calendar events in simple event list view.",
            null,
            null,
            null,
            null,
            null
        ],
        "5a8d35cb1aa3694db466af3da76abf3d6fb93c837d671488805cab44910e9c38": [
            null,
            null,
            "task: change the calendar view to a simple event list and then to a monthly view.",
            null,
            "task: toggle between simple event list and another calendar view",
            null
        ],
        "a0580636289877f1e38e3d0fb2dc819e0bafcdaa9cfe463ed66522d8f283685a": [
            "task: search for a specific event or appointment in the calendar.",
            null,
            null,
            null,
            null,
            "task: search for a specific event or appointment in the calendar.",
            null
        ],
        "5534c66d5f37c0f29958ac89e66254fa62b5e261bf014a6fb71d9aa78a75d4b3": [
            "task: add holidays to the calendar.",
            "task: add birthdays of contacts to the calendar.",
            "task: add anniversaries to the calendar for contacts.",
            "task: import events from an .ics file into the calendar app.",
            "task: export calendar events to an .ics file",
            "task: customize calendar settings",
            "task: view information about the calendar app and its features",
            null
        ],
        "d153f77cd44709997f1a7e9d001e3e4724b767b98d985b994cdefd5ace2fc89b": [
            "Task: Add holidays for Algeria to the calendar.",
            "Task: Add holidays for Argentina to the calendar.",
            "Task: Add holidays for Australia to the calendar.",
            "Task: Add holidays for Belgium to the calendar.",
            "Task: Add holidays for Bolivia to the calendar.",
            "task: add holidays for Brasil to the calendar.",
            "Task: Add holidays for Canada to the calendar.",
            "Task: Add holidays for China to the calendar.",
            "Task: Add holidays for Colombia to the calendar.",
            "Task: Add holidays for Česká republika to the calendar.",
            "Task: Add holidays for Denmark to the calendar.",
            "Task: Add holidays for Germany to the calendar.",
            "Task: Add holidays for the country \"Eesti\" to the calendar.",
            "Task: Add holidays for Spain to the calendar.",
            null,
            "Task: Add holidays for the country Éire (Ireland) to the calendar.",
            "Task: Add holidays for France to the calendar.",
            "Task: Add holidays for the selected country (Hanguk) to the calendar.",
            "Task: Add holidays for the country \"Hellas\" to the calendar.",
            "Task: Add holidays for the country \"Hrvatska\" to the calendar.",
            "Task: Add holidays for the country \"India\" to the calendar.",
            "Task: Add holidays for Indonesia to the calendar.",
            "Task: Add holidays for Iceland to the calendar.",
            "Task: Add holidays for Italy to the calendar.",
            "Task: Add holidays for the country \"Latvija\" to the calendar.",
            "Task: Add holidays for the country \"Lietuva\" to the calendar.",
            "Task: Add holidays for Luxemburg to the calendar.",
            "Task: Add holidays for the country \"Makedonija\" to the calendar.",
            "Task: Add holidays for Magyarország (Hungary) to the calendar.",
            "Task: Add holidays for Mexico to the calendar.",
            "Task: Add holidays for the country \"Nederland\" to the calendar.",
            "Task: Add holidays for Japan to the calendar.",
            "Task: Add holidays for the country \"Norge\" to the calendar.",
            "Task: Add holidays for Austria to the calendar.",
            "Task: Add holidays for Pakistan to the calendar.",
            "Task: Add holidays for the country \"Polska\" to the calendar.",
            "Task: Add holidays for Portugal to the calendar.",
            "Task: Add holidays for Russia to the calendar.",
            "Task: Add holidays for Romania to the calendar.",
            "Task: Add holidays for Switzerland to the calendar.",
            "Task: Add holidays for Serbia to the calendar.",
            "Task: Add holidays for Slovenia to the calendar.",
            "Task: Add holidays for the country \"Slovensko\" to the calendar.",
            "task: add holidays to the calendar for South Africa.",
            "task: add holidays for the country \"Suomi\" to the calendar.",
            "Task: Add holidays for the country \"Sverige\" to the calendar.",
            "Task: Add holidays for Ukraine to the calendar.",
            "Task: Add holidays for the United Kingdom to the calendar.",
            "Task: Add United States holidays to the calendar."
        ],
        "0dfcd2ff9939bb98a09aca5707c630569835c9f6d66e24ea1e2d8dc53229c7a6": [
            null,
            "task: Add contact birthdays to the calendar.",
            "task: manage calendar access permissions for contacts",
            null
        ],
        "ee9f0855b6686a9d0bd515c215315d215fa6d3438addbaf227d25e19eaa3185a": [
            null,
            "task: Import events from an .ics file into the calendar.",
            "task: Import events from an .ics file to the calendar.",
            null
        ],
        "4927876f7234d01f13659cbd78612b2d37be153f11f451ff6ed0a731a0aff240": [
            null,
            "task: Import events from an .ics file into the calendar.",
            "task: Import events from an .ics file and set alarms for them.",
            "task: Import events from an .ics file into the calendar on an Android device.",
            "task: Import audiobooks from an .ics file and browse/manage the imported audiobook items.",
            "task: Import events from an .ics file and view the 6 items in the DCIM folder.",
            "task: Import events from an .ics file into the calendar app.",
            "task: Import events from an .ics file and download it to the smartphone app's calendar.",
            "task: Import movie events from an .ics file and view the list of movies.",
            "task: Import events from an .ics file and play music.",
            "task: Import events from an .ics file and enable notifications for the calendar app.",
            "task: Import events from an .ics file and view pictures in the smartphone app.",
            "task: Import events from an .ics file and browse and manage podcasts.",
            "task: Import events from an .ics file into the calendar.",
            null,
            "task: Import events from an .ics file and set a specific ringtone for the calendar notifications.",
            "task: Import events from an .ics file into the calendar.",
            "task: Import events from an .ics file into the calendar app."
        ],
        "0fbb9314ecc2dc97537efa196c898becd9cc76bd2bde96ea0f569c03fc7be33d": [
            null,
            null,
            "task: Import events from an .ics file and set alarms for them in the calendar app.",
            null,
            null
        ],
        "88f29884fb5eacc4d8ce762764b2b603ed48812c458991e3abd38bffb6201dff": [
            null,
            "task: export calendar events to an .ics file and save it in the internal storage folder.",
            "task: Export events from the calendar to an .ics file and manage alarms for those events.",
            "task: export calendar events to an .ics file and save it in an Android folder.",
            "task: Export events from the calendar to an .ics file and manage audiobooks within the smartphone app.",
            "task: Export events from the calendar to an .ics file and manage files within the DCIM folder in the smartphone app.",
            "task: Export calendar events to an .ics file and save it in the Documents folder.",
            "task: export calendar events and download them as an .ics file.",
            "task: export calendar events to an .ics file and view movies with 0 items.",
            "task: Export calendar events to an .ics file and select a folder to manage the exported file.",
            "task: Export calendar events to an .ics file and manage notifications in the smartphone app.",
            "task: Export calendar events as an .ics file and manage pictures within the calendar app.",
            "task: Export calendar events to an .ics file and access podcasts with 0 items.",
            "task: Export events from the smartphone app calendar and save them as an .ics file in a specific folder.",
            "task: Export calendar events to an .ics file and save it in a selected folder.",
            null,
            "task: export calendar events to an .ics file and manage ringtones within the smartphone app.",
            "task: export calendar events to an .ics file and save it in a specific folder within the smartphone app.",
            "task: export calendar events to an .ics file and save it in a specific folder within the smartphone app."
        ],
        "44320aacba99d74a471c8ea105cb386326fa93cf80b9334a4b9ae86181eebfbd": [
            null,
            null,
            "task: Export calendar events to an .ics file and manage alarms for those events.",
            null,
            null,
            null
        ],
        "6c4d5e9b3856a2505fed43c416dca9ffb02b886db89fcb0c3bfd1fab26ee24eb": [
            null,
            null,
            "task: search for a specific event or appointment in the calendar.",
            null,
            null,
            null,
            "task: search for an event or appointment in the calendar.",
            null
        ],
        "e5bb0f7b3eb647b48936f7e4e35769d570c6ae713970b911aa4297f24275ca7f": [
            "task: customize calendar settings and event reminders",
            null,
            "Task: Customize the colors of the calendar interface.",
            "Task: Customize event types in the calendar.",
            "task: change the time format to 24-hour format in the calendar settings.",
            "Task: Change the start day of the week in the calendar settings to Monday.",
            "task: Disable the \"What's New\" pop-up on calendar startup.",
            "Task: Delete all events from the calendar.",
            null,
            "Task: Disable vibrate on reminder notifications in the calendar app.",
            "Task: Change the default reminder sound for calendar events.",
            "Task: Disable the option to always use the same snooze time for event reminders.",
            "task: Adjust the snooze time for event reminders to 10 minutes.",
            null,
            null,
            "task: turn off CalDAV sync for the calendar.",
            null,
            "task: customize the start time of the day in the calendar to 07:00.",
            "task: Change the end time of the day in the calendar to 23:00.",
            null,
            "Task: Disable the display of week numbers on the calendar.",
            "Task: Disable the grid view in the calendar settings.",
            null,
            "task: customize calendar settings and turn off the option to replace event description with location.",
            "Task: Customize the calendar settings to display events from the past never.",
            null,
            "task: Adjust the font size of the calendar to medium."
        ],
        "a39f4e7423a7ec05e4957e3d2f62cdb8ac8603374c98ce2944ecd1ebe401a96c": [
            null,
            null,
            "task: customize the calendar colors and apply a dark theme to all Simple Apps.",
            "task: change the text color of the calendar in the app settings.",
            "task: change the background color of the calendar in the app settings.",
            "task: customize the primary color of the calendar and apply it to all Simple Apps.",
            "task: customize the colors of the calendar and apply them to all Simple Apps.",
            null
        ],
        "b555610691d75afd1c4cb87308b58d4f99273beea38325be444d78c94e28d986": [
            null,
            "task: customize the colors of the calendar app.",
            "task: Unlock the calendar function by purchasing the Simple Thank You app.",
            null
        ],
        "aa57b74d867f195506afa45cddabf5199e67a99c324d7b1737200c1a9ec959e5": [
            "Task: Customize the colors and theme of the calendar app.",
            "Task: Change the theme of the calendar app to Dark and customize the colors.",
            "Task: Customize the colors and theme of the calendar app to have a dark red theme.",
            "Task: Customize the colors and theme of the calendar app.",
            "Task: Customize the colors and theme of the calendar app.",
            null
        ],
        "1f858da570d72fc2746e7cd21ac2951b72173dc7602f9d9e106fff093ce451d1": [
            null,
            null,
            "task: customize the calendar colors and apply the dark theme to all Simple Apps.",
            "task: customize the calendar colors and apply them to all Simple Apps",
            null,
            null,
            null,
            null,
            null
        ],
        "6d9c92d565fb64f096c91972078aff8091e9454266126dceb64773451254deb7": [
            null,
            null,
            "task: add a new event type to the calendar.",
            "task: Add or edit holidays in the calendar.",
            "task: create a new regular event type in the calendar.",
            null
        ],
        "5e6d92c26cdd25bb7b5aaa78ee87746384f33a49cfdd9f7ce93810c348652f34": [
            null,
            null,
            null,
            "Task: Add a new event type to the calendar with a specific title and color.",
            "Task: Add a new event type in the calendar with a specific title and color.",
            null
        ],
        "e76daded6e1b908aa09b51fe2d2bc59c51805cfd8410d347e5948abcf409f865": [
            null,
            null,
            null,
            null,
            "Task: Cancel a regular event in the calendar and make changes to the event title, type, and color.",
            "Task: Edit the title, type, and color of a regular calendar event and confirm the changes.",
            null
        ],
        "26c75e39ef6829993b7623d3fba5f203bfb6b9bb5372a6cb912330f3b11d6693": [
            null,
            null,
            null,
            null,
            null,
            null,
            null
        ],
        "b030be607a7b965b12afa6b526f698a0c2a454938b56bb9753a0eed6516a4aa6": [
            null,
            "task: confirm deletion of all events in the calendar app.",
            "task: delete all events in the calendar app.",
            null
        ],
        "1d37b5a0628f5da09a91909ab5aa8fb175ef4f5e000c8e7b2baa06df4938b113": [
            null,
            "Task: Customize the reminder sound for calendar events on a smartphone.",
            null,
            "task: change the reminder sound for calendar events to \"No sound\" on a smartphone.",
            "Task: Change the reminder sound for calendar events on a smartphone.",
            "task: change the reminder sound for calendar events to \"Adara\" on a smartphone.",
            "Task: Change the reminder sound for calendar events to \"Aldebaran\" on a smartphone.",
            "task: change the reminder sound for calendar events to \"Altair\" on a smartphone.",
            "Task: Change the reminder sound for calendar events and select Alya as the default sound.",
            "task: change the reminder sound for calendar events to \"Antares\" on a smartphone.",
            "Task: Change the reminder sound for calendar events to \"Antimony\" on a smartphone.",
            "task: change the reminder sound for calendar events to \"Arcturus\" on a smartphone.",
            "task: Change the reminder sound for calendar events to \"Argon\" on a smartphone.",
            "task: change the reminder sound for calendar events on the smartphone.",
            "Task: Change the reminder sound for calendar events on the smartphone.",
            null,
            "task: change the reminder sound for calendar events to \"Beat Box Android\"",
            "task: Change the reminder sound for calendar events to \"Bellatrix\" on a smartphone.",
            "Task: Change the reminder sound for calendar events to \"Beryllium\" on a smartphone.",
            "task: change the reminder sound for calendar events to \"Betelgeuse\" on a smartphone.",
            "Task: Change the reminder sound for calendar events to \"Caffeinated Rattlesnake\" on a smartphone.",
            "task: change the reminder sound for calendar events to \"Canopus\" on a smartphone.",
            "Task: Change the reminder sound for calendar events to \"Capella\" on a smartphone.",
            "task: Change the reminder sound for calendar events to \"Captain's Log\".",
            "Task: Change the reminder sound for calendar events to \"Castor\" on a smartphone.",
            "task: change the reminder sound for calendar events to \"Ceti Alpha\" on a smartphone.",
            "Task: Change the reminder sound for calendar events to \"Cobalt\" on a smartphone.",
            "Task: Change the reminder sound for calendar events to \"Cricket\" on a smartphone.",
            "Task: Change the reminder sound for calendar events to \"Dear Deer\" on a smartphone.",
            "task: change the reminder sound for calendar events to \"Deneb\".",
            "task: Change the reminder sound for calendar events to \"Doink\" on a smartphone.",
            "Task: Change the reminder sound for calendar events on the smartphone.",
            "Task: Change the reminder sound for calendar events to \"Drip\" on the smartphone.",
            "task: change the reminder sound for calendar events to \"Electra\" on a smartphone.",
            "task: Change the reminder sound for calendar events to \"Fluorine\".",
            "task: change the reminder sound for calendar events to \"Fomalhaut\" on a smartphone.",
            "task: Change the reminder sound for calendar events to \"Gallium\" on a smartphone.",
            "Task: Change the reminder sound for calendar events to \"Heaven\" on a smartphone.",
            "task: Change the reminder sound for calendar events to Helium.",
            "task: Change the reminder sound for calendar events to \"Highwire\" on a smartphone.",
            "task: Change the reminder sound for calendar events to \"Hojus\" on a smartphone.",
            "task: change the reminder sound for calendar events to \"Iridium\" on a smartphone.",
            "task: change the reminder sound for calendar events to \"Krypton\" on a smartphone.",
            "task: change the reminder sound for calendar events to \"Kzurb Sonar\" on a smartphone.",
            "task: Change the reminder sound for calendar events to \"Lalande\" on a smartphone.",
            "task: Change the reminder sound for calendar events to \"Look At Me\" on a smartphone.",
            "Task: Change the reminder sound for calendar events to \"Merope\" on the smartphone.",
            "Task: Change the reminder sound for calendar events to \"Mira\" on a smartphone.",
            "Task: Change the reminder sound for missed calendar events to something other than the default \"Pixie Dust\".",
            "task: change the reminder sound for calendar events to \"Moonbeam\"",
            "task: Change the reminder sound for calendar events to \"On The Hunt\".",
            "Task: Change the reminder sound for calendar events to \"Palladium\" on a smartphone.",
            "task: Change the reminder sound for calendar events to \"Pixie Dust\" on a smartphone.",
            "task: change the reminder sound for calendar events to \"Pizzicato\" on a smartphone.",
            "Task: Change the reminder sound for calendar events to \"Plastic Pipe\" on a smartphone.",
            "task: change the reminder sound for calendar events to Polaris on a smartphone.",
            "task: Change the reminder sound for calendar events to \"Pollux\" on a smartphone.",
            "task: change the reminder sound for calendar events to Procyon.",
            "task: change the reminder sound for calendar events to \"Proxima\" on a smartphone.",
            "task: change the reminder sound for calendar events to \"Radon\" on a smartphone.",
            "Task: Change the reminder sound for calendar events to \"Regulus\" on a smartphone.",
            "Task: Change the reminder sound for calendar events to Rubidium on the smartphone.",
            "Task: Change the reminder sound for calendar events to \"Selenium\" on a smartphone.",
            "task: Change the reminder sound for calendar events to \"Shaula\" on a smartphone.",
            "task: change the reminder sound for calendar events to \"Sirius\" on a smartphone.",
            "task: change the reminder sound for calendar events to \"Sirrah\" on a smartphone.",
            "Task: Change the reminder sound for calendar events to \"Space Seed\" on a smartphone.",
            "Task: Change the reminder sound for calendar events to \"Spica\" on the smartphone.",
            "Task: Change the reminder sound for calendar events to \"Strontium\" on a smartphone.",
            "task: Change the reminder sound for calendar events to \"Syrma\" on a smartphone."
        ],
        "2563cd0132df7babcf5f9118008656bfd16c87e3d799ad0d679adbe9d56e76d1": [
            "task: adjust the snooze time for calendar event reminders to 10 minutes.",
            "task: adjust the snooze time for calendar event reminders to 5 minutes.",
            "task: adjust the snooze time for calendar event reminders to 10 minutes.",
            "task: set the snooze time for calendar reminders to 10 minutes and check the option for 30 minutes snooze time.",
            "task: set the snooze time for calendar reminders to 10 minutes and check the option for a 1-hour reminder interval.",
            "task: customize snooze time for calendar events to 10 minutes.",
            "task: set the snooze time for calendar reminders to 10 minutes.",
            null
        ],
        "43ff20b2170ac83f282914166cb4a238dc44227ee2e1538042496fe067962d47": [
            "task: change the reminder time unit to minutes and confirm the changes.",
            "task: Set the reminder time unit to hours and confirm the selection.",
            "task: Set the reminder time unit to days and confirm the selection.",
            "task: change the settings to display events from the past and cancel the reminder time unit.",
            "task: change the settings to display events from the past and confirm the changes.",
            null
        ],
        "37d74d294f771243b96af3e6e82d1a7b7295b06891f76c69b80a96ed5d4f1930": [
            "task: adjust the font size of the calendar display to medium.",
            "task: adjust the font size of the calendar display",
            "task: adjust the font size of the calendar display to large.",
            null
        ],
        "77dfea11565b42a31fee51cb52720d35ec189b30db4c597fd2ea88af5f833b2e": [
            "task: create a new event in the calendar app.",
            null,
            "task: create a new event and save it in the calendar app.",
            null,
            null,
            null,
            "task: create a new event in the calendar with the all-day option turned off.",
            "task: create a new event on July 1st in the calendar app.",
            "task: create a new event at 12:00 PM in the calendar app.",
            "task: create a new event on July 1st in the calendar app.",
            "task: create a new event at 12:00 PM in the calendar app.",
            "task: create a new event in the calendar and set a reminder for 10 minutes before the event.",
            "Task: Add a new event to the calendar and set multiple reminders for it.",
            "task: create a new event in the calendar without any repetition.",
            "Task: Create a new regular event in the calendar app.",
            null
        ],
        "1de405d94a0dc161d25004ddbf768abf707e415a63851c67ba42d90234788c52": [
            "task: create a new event on July 1, 2023",
            "task: create a new event on July 1st",
            "task: create a new event on July 1, 2023.",
            "task: create a new event on July 2, 2023 in the calendar.",
            "task: create a new event on July 3, 2023.",
            "task: create a new event on July 4, 2023 in the calendar.",
            "task: create a new event on July 5, 2023.",
            "task: create a new event on July 6, 2023.",
            "task: create a new event on July 7, 2023.",
            "task: create a new event on July 8, 2023.",
            "task: create a new event on July 9, 2023.",
            "task: create a new event on July 10, 2023.",
            "task: create a new event on July 11, 2023",
            "task: create a new event on July 12, 2023.",
            "task: create a new event on July 13, 2023.",
            "task: create a new event on July 14, 2023.",
            "task: create a new event on July 15, 2023.",
            "task: create a new event on July 16, 2023.",
            "task: create a new event on July 17, 2023.",
            "task: create a new event on July 18, 2023.",
            "task: create a new event on July 19, 2023.",
            "task: create a new event on July 20, 2023",
            "task: create a new event on July 21, 2023.",
            "task: create a new event on July 22, 2023.",
            "task: create a new event on July 23, 2023.",
            "task: create a new event on July 24, 2023",
            "task: create a new event on July 25, 2023.",
            "task: create a new event on July 26, 2023.",
            "task: create a new event on July 27, 2023.",
            "task: create a new event on July 28, 2023.",
            "task: create a new event on July 29, 2023",
            "task: create a new event on July 30, 2023.",
            "task: create a new event on July 31, 2023.",
            "task: create a new event on July 1st and navigate to the previous month.",
            "task: create a new event on July 1st and navigate to the next month.",
            "task: create a new event on July 1st and then cancel it.",
            "task: create a new event on July 1st",
            null
        ],
        "05f8de41ce1b0c123111ea9222baa9416ddd440d57599ff16b55009df43ffc0e": [
            "task: create a new event at 12:00 PM on the selected date in the calendar app.",
            null,
            "task: create a new event in the calendar app at 12:00 PM for a duration of 1 hour.",
            "task: create a new event in the calendar app at 12:00 PM, with the time set to AM.",
            "task: create a new event at 12:00 PM and set it as an AM event in the calendar app.",
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            "task: create a new event in the calendar app and set the time to 12:00 PM.",
            "task: create a new event at 12:00 PM and then cancel it",
            "task: create a new event in the calendar app at 12:00 PM.",
            null
        ],
        "7be671f67b12a11b3a667b6780e9e80104be5d122c8a534c1584af702c2fd5f7": [
            "task: create a new event in the calendar with a reminder set for 10 minutes before the event, and customize the reminder options.",
            "Task: Create a new event in the calendar with a reminder set for 10 minutes before the event starts.",
            "task: create a new event in the calendar with a reminder set for 10 minutes before the event, and an additional reminder set for 1 minute before the event.",
            "Task: Create a new event in the calendar with a reminder set for 10 minutes before the event.",
            "task: create a new event in the calendar with a reminder set for 10 minutes before the event.",
            "Task: Set a reminder for a new event in the calendar with a notification 10 minutes before the event, and an additional notification 30 minutes before the event (unchecked).",
            "Task: Create a new event in the calendar and set reminders for it, with options to be reminded 10 minutes before and 1 hour before the event.",
            "Task: Set a new event reminder in the calendar with a custom notification time of 10 minutes before the event.",
            null
        ],
        "67d7de90b58f15bd10b1849244985f177aca5e5185efb840cdf4abb0929d3b22": [
            "task: create a new event on the calendar without any repetition.",
            "task: create a new daily event without repetition in the calendar.",
            "task: create a new weekly event without repetition in the calendar.",
            "task: create a new monthly event without repetition in the calendar.",
            "task: create a new yearly event with no repetition.",
            "task: create a new event in the calendar with custom repetition options.",
            null
        ],
        "08c085a404864d3a0aba71a1700a518fde0caa977a5caaca413b3e1a650f4f17": [
            "task: create a new regular event in the calendar and exclude holidays.",
            "task: create a new regular event in the calendar.",
            "task: create a new regular event and add a new type to the calendar.",
            null
        ],
        "6d7a2042bf7d436d87f1070d8cda34b6188388bcc1a16b399a21429cbb8ca598": [
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null
        ],
        "fc730a8bba08c33a902a3a4119cea4ff4808d5d2449e228761d5a2ef73867d5c": [
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null
        ]
    },
    "filemanager": {
        "4ab22c498122e2ee239fea7ea030f4f60c03229f1e8e59353d5d52832a2837f1": [
            null,
            "task: sort files in the filemanager.",
            "task: add a file to favorites",
            "task: manage files, search, sort, add to favorites, view options, navigate folders",
            "task: manage and organize internal files, search for specific files, sort files, add files to favorites, view file options, and navigate through folders.",
            "Task: Set or manage alarms on the smartphone.",
            "task: manage files, search, sort, add to favorites, view options, navigate folders on the Android device.",
            "Task: Add audiobooks to the file manager, search for specific audiobooks, sort audiobooks, add audiobooks to favorites, view options for audiobooks, navigate through audiobook folders.",
            "task: view and manage photos and videos in the DCIM folder.",
            "task: view and manage documents, search for specific files, sort files, add files to favorites, and navigate through folders.",
            "task: download and manage files, search, sort, add to favorites, view options, and navigate folders.",
            "Task: View and manage movies in the file manager, including searching, sorting, adding to favorites, and navigating folders.",
            "task: manage music files, search, sort, add music to favorites, view options, navigate music folders.",
            "Task: View and manage notifications for files, including searching, sorting, adding to favorites, and navigating folders.",
            "Task: View and manage pictures, search, sort, add pictures to favorites, view options, and navigate through picture folders.",
            null,
            "Task: View recently accessed files and manage them by searching, sorting, adding to favorites, and navigating folders.",
            "task: manage files, search, sort, add to favorites, view options, navigate folders in the storage.",
            null,
            "task: view and manage pictures in the file manager.",
            "Task: Access and manage podcasts, including searching, sorting, adding to favorites, and navigating folders.",
            "task: add a new ringtone to the file manager.",
            "task: view or manage files, search, sort, add to favorites, view options, navigate folders.",
            "task: view the details of a file and its properties.",
            null
        ],
        "6919cfa097bb6dc5bcc70b3a04c75500aeb04e8db499b49ba0c033318894e3aa": [
            null,
            "task: Change the storage location for file management in the smartphone app filemanager.",
            "Task: Select internal storage and manage files in the smartphone app filemanager.",
            null
        ],
        "5f85df70a940e359b72b4d31661621c0d94c5b998ad8e89651396c59162f3e69": [
            null,
            "task: navigate to the internal storage, uncheck the SD card, and go to the home folder in the file manager app.",
            null,
            null,
            "task: access files on the SD card",
            null,
            "task: Move files from internal storage to SD card on Android.",
            null,
            "task: access and manage files in the internal storage and SD card, specifically in the DCIM folder.",
            null,
            "task: download files from the internal storage or SD card.",
            "task: Access the LOST.DIR folder and view its contents.",
            null,
            "task: access and manage music files on the internal storage or SD card.",
            "task: manage files, search, go to home folder, sort, and access more options related to internal storage and notifications.",
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null
        ],
        "35eaf64d1ecc1be38d8ba6b606c51c8f981caee6862065502be6803f57796b58": [
            null,
            "task: Select storage location (Internal or SD Card) for managing files.",
            "task: Select internal storage, manage files on the SD card, and go back to the previous page.",
            null
        ]
    },
    "voicerecorder": {
        "ebc3c7ccc0dfade1d397a93599b9919dc50a79323f6b8302b99aff76932e937f": [
            null,
            "task: adjust the settings or access information about the app.",
            "task: Access information about the voicerecorder app.",
            null,
            null,
            "task: play audio files",
            null
        ],
        "4a49c9cd6a208c6e931246695e44bd78a97eeb47c5a7f11a226d98a6a18bbd98": [
            null,
            null,
            "task: customize the colors and settings of the voicerecorder app.",
            "task: customize the colors of the voicerecorder widget.",
            null,
            "task: customize the date and time format for the voicerecorder app.",
            "task: customize settings for the voicerecorder app, specifically trying to hide the recording notification.",
            "task: customize settings for the voicerecorder app, specifically enabling the automatic start of recording after launching the app.",
            "task: customize the settings for the voicerecorder app, specifically the location to save recordings and other preferences.",
            "task: customize the settings of the voicerecorder app, specifically changing the extension to m4a.",
            "task: change the audio source for the voice recorder app.",
            "task: adjust the bitrate setting for the voice recorder app.",
            null,
            "task: customize the bitrate of the voice recordings in the voicerecorder app."
        ],
        "06d12a81a984d165f6107d52300085d901815170a2c6546fc7129a5ff30b88da": [
            null,
            "task: change the color theme of the voicerecorder app to dark.",
            "task: change the text color for the voicerecorder app.",
            "task: change the background color of the voicerecorder app.",
            "task: change the primary color of the voicerecorder app.",
            "task: change the app icon color for the voicerecorder app.",
            null
        ],
        "db8da4c4aed69c1ee76c3c58386edc9a9b8924ab9d096893dc87ae36659c73bb": [
            null,
            "task: customize the colors and theme of the voicerecorder app to a dark theme.",
            null
        ],
        "ee4bc85165d8e30eb0e6662bbd800d46bbbc7663b2262c79288c29040a6fb67d": [
            "task: customize the colors and theme of the voicerecorder app and enable/disable auto light/dark mode.",
            "task: customize the color theme of the voicerecorder app to dark mode.",
            "task: change the theme of the voicerecorder app to a light theme.",
            "task: customize the colors of the voicerecorder app and set the theme to Dark, specifically selecting the Dark red color.",
            "task: customize the colors and theme of the voicerecorder app to a dark theme with white checkbox unchecked.",
            "task: customize the colors and theme of the voicerecorder app to a dark theme with black & white colors.",
            "task: customize the colors and theme of the voicerecorder app and enable the custom settings.",
            null
        ],
        "e4bc83f77703f52d07cd5f9ca5fb500d16741aefd16d4f6f35002bd13525c940": [
            "task: change the date and time format for voice recordings to a format other than 16.02.2021.",
            "task: change the date and time format for recording voice on the voicerecorder app.",
            "task: change the date and time format for voice recordings to 02/16/2021",
            "task: change the date and time format for voice recordings to 16-02-2021.",
            "task: change the date and time format for recording voice on the voicerecorder app.",
            "task: change the date and time format for recording voice on the voicerecorder app.",
            "task: change the date and time format for recording voice on the voicerecorder app.",
            "task: Change the date and time format for recording voice on the voicerecorder app to February 16, 2021.",
            "task: change the date and time format to use 24-hour time format in the voicerecorder app.",
            "task: change the date and time format for recording voice on the voicerecorder app.",
            "task: change the date and time format for recording voice on the voicerecorder app.",
            null
        ],
        "ee299cea28a932fda0ab93f6c90cf8f780430011b03f9faf73b7cfc4cdf494fe": [
            null,
            null,
            null,
            null,
            null,
            null,
            "task: customize settings for the voicerecorder app, specifically hiding the recording notification.",
            null,
            null,
            null,
            null,
            null,
            null,
            null
        ],
        "c0b0baa7678fd8322ba820a18a1ab1ba2901fcfc7d0440fc830b6307491d046f": [
            null,
            "task: change the default save location for voice recordings to the internal storage.",
            "task: change the settings to save voice recordings in the \"Music\" folder.",
            "task: change the settings to save recordings in the Internal/Music/Recordings folder and access the recordings.",
            "task: change the save location of voice recordings to Internal/Music/Recordings and select the file \"test1.m4a\" for further action.",
            "task: change the save location of voice recordings to Internal/Music/Recordings",
            "task: change the default folder for saving recordings in the voicerecorder app.",
            "task: change the default save location for voice recordings to Internal/Music/Recordings.",
            null
        ],
        "6919cfa097bb6dc5bcc70b3a04c75500aeb04e8db499b49ba0c033318894e3aa": [
            null,
            "task: Change the storage location for voice recordings from Internal to SD Card.",
            "task: Change the storage location for saving recordings to the internal memory instead of the SD card.",
            null
        ],
        "f4e3bb56b18f61edcbc485302f7614a0c5ba2e590c7ce1e15e06c3272314ca1e": [
            null,
            "task: change the default storage location for voice recordings to the SD card.",
            "task: Change the default folder for saving recordings in the voicerecorder app to Internal/Music/Recordings and check if SD Card is selected.",
            "task: Change the default folder for saving recordings in the voicerecorder app to Internal/Music/Recordings.",
            "task: Change the default storage location for voice recordings to the internal storage and access the audiobooks section.",
            "task: Change the default folder for saving recordings in the voicerecorder app to Internal/Music/Recordings.",
            "task: Change the default folder for saving recordings in the voicerecorder app to Internal/Music/Recordings.",
            "task: Change the default folder for saving recordings in the voicerecorder app to Internal/Music/Recordings and check if SD Card is selected.",
            "task: Change the default save location for voice recordings to the internal storage instead of the SD card.",
            "task: Change the default storage location for voice recordings to the internal storage instead of the SD card.",
            "task: Change the default folder for saving recordings to Internal/Music/Recordings in the voicerecorder app.",
            "task: Change the default folder for saving recordings in the voicerecorder app and manage notification settings.",
            null,
            null,
            null,
            "task: Change the default storage location for recordings in the voicerecorder app to the internal storage instead of the SD card.",
            "task: Change the default folder for saving recordings to Internal/Music/Recordings and check if SD Card is selected for storage.",
            "task: Change the default folder for saving recordings in the voicerecorder app to Internal/Music/Recordings.",
            null
        ],
        "91794cabe9baed2051b13acffe4b46f802ee09d1f65e86fa1b717b46bac5b418": [
            null,
            null,
            "task: Change the folder location for saving voice recordings to the internal storage and set an alarm.",
            null,
            null,
            null
        ],
        "95beae32f88ba63e6f6e4cd7eaf4a4e3ae5ba656437bfadff97612b12d90732e": [
            "task: Change the audio format of the voicerecorder app to m4a and disable the m4a extension.",
            "task: Change the audio format to m4a and uncheck the mp3 format in the settings of the voicerecorder app.",
            "task: change the audio format to m4a and enable the ogg (Opus) format in the settings.",
            null
        ],
        "5abd380a0c963678d243621338a4b57c51aa452f7503f101867b33b7eb2e323e": [
            "task: configure the audio source settings for the voice recorder app, specifically disabling the camera as a recording option.",
            "task: change the audio source for recording in the voicerecorder app to the camera and select the Android default option.",
            "task: configure audio source settings for the voice recorder app.",
            "task: configure audio source settings for voice recording and enable/disable voice recognition feature.",
            "task: configure audio source settings for voice recording and enable voice communication.",
            "task: Select audio source as camera, enable unprocessed recording, and go back to the previous interface.",
            "task: Adjust audio source settings for voice recording, specifically checking the voice performance option.",
            null
        ],
        "d95438ce61e20b6f15338518b419c703ebd4fbe52def4f815c0dfd3c43ce5357": [
            "task: change the recording quality to 32 kbps in the voicerecorder app.",
            "task: change the recording quality to 64 kbps in the voicerecorder app settings.",
            "task: change the recording quality to 96 kbps in the voicerecorder app.",
            "task: change the recording quality to 128 kbps in the voicerecorder app.",
            "task: change the recording quality to 160 kbps in the voicerecorder app.",
            "task: change the recording quality to 192 kbps in the settings and navigate back.",
            "task: change the recording quality to 256 kbps in the settings.",
            "task: change the recording quality to 320 kbps in the voicerecorder app.",
            null
        ],
        "01761c55c458560c451ae5ab946cb58da6702f4ce6f72f6221b0d3ce78e138be": [
            null,
            null,
            "task: find answers to frequently asked questions about the voicerecorder app.",
            "task: contact the support team via email for assistance or inquiries about the voicerecorder app.",
            null,
            "task: find information about the contributors of the voicerecorder app.",
            "task: donate to support the voicerecorder app.",
            null,
            "task: Share information about the voicerecorder app on Facebook.",
            "task: access the GitHub page of the voicerecorder app.",
            "task: access the Reddit page for the voicerecorder app.",
            "task: find information about the voicerecorder app and access its social media links",
            null,
            null,
            "task: access the website of the voicerecorder app to gather more information or download the app.",
            "task: read the privacy policy of the voicerecorder app.",
            "task: view the third party licences for the voicerecorder app.",
            "task: find information about the voicerecorder app and check the current version.",
            null
        ],
        "41f3305e06df4df3ac8ee3f17ad17a40a34230880a4a372f4cdaa288d55541b8": [
            null,
            null,
            null,
            "task: play the voice recording \"test1.m4a\" that was recorded on 30.06.2023 at 12:26 PM.",
            "task: play the voice recording \"test2.m4a\" that was recorded on 30.06.2023 at 12:26 PM.",
            "task: start playing a voice recording from the beginning.",
            "task: play the previous voice recording.",
            "task: play or pause a voice recording on the voicerecorder app.",
            "task: play the next voice recording in the player.",
            "task: Play a voice recording.",
            null,
            null
        ],
        "04d9f6047cbe57fd18cd55bf2aafc94dd0c67c26c4380ca5cade1c4cb57397a3": [
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            "task: play a specific voice recording from the voicerecorder app.",
            null,
            null,
            null,
            null,
            null,
            null
        ]
    }
}